{
    "intents": [
      {
        "tag": "greeting",
        "patterns": "hi",
        "responses": "hey :)"      
      },
      {
        "tag": "greeting",
        "patterns": "hey",
        "responses": "hey :)"      
      },
      {
        "tag": "greeting",
        "patterns": "hello",
        "responses": "Hi there, how can I help?"      
      },
      {
        "tag": "greeting",
        "patterns": "how are you",
        "responses": "Hi there, how can I help?"      
      },
      {
        "tag": "greeting",
        "patterns": "good day",
        "responses": "Hi there, what can I do for you?"      
      },
      {
        "tag": "greeting",
        "patterns": "is anyone there?",
        "responses": "Hi there, how can I help?"      
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "comprehensiveincome",
        "patterns": [
          "What is comprehensive income?",
          "What is comprehensive income net of tax?",
          "What is net sales?"
        ],
        "responses": [
          "The amount after tax of increase (decrease) in equity from transactions and other events and circumstances from net income and other comprehensive income, attributable to parent entity. Excludes changes in equity resulting from investments by owners and distributions to owners."
        ]
      },      
      {
        "tag": "revenue",
        "patterns": [
          "What is revenue?",
          "What is net revenue?",
          "What is net sales?",
          "what is total revenue?",
          "what is total net revenue?"
        ],
        "responses": [
          "The amount of money received from the sale of products or services before taking into account any expenses. It is referred to as the top line and can also be called Sales. Occasionally, it is referred to as net sales to take into account items that are not expenses and reduce revenue such as returns, discounts, and allowances."
        ]
      },
      {
        "tag": "cogs",
        "patterns": [
          "what is cogs?",
          "what is cost of goods sold?",
          "what is cost of sales?",
          "What is cost of revenue?",
          "What is cost of goods and services sold?"
        ],
        "responses": [
          "The direct cost of goods or services produced and sold during the reporting period."
        ]
      },
      {
        "tag": "depreciation",
        "patterns": [
          "what is depreciation?"
        ],
        "responses": [
          "The amount of expense recognized in the current period that reflects the allocation of the cost of tangible assets over the assets' useful lives. Includes production and non-production related depreciation"
        ]
      },
      {
        "tag": "ebit",
        "patterns": [
          "what is ebit?",
          "what is operating profit?",
          "What is operating income?",
          "what is earnings before interest or taxes?"
        ],
        "responses": [
          "The portion of profit or loss for the period, before income taxes and interest expenses, which is attributable to the parent"
        ]
      },
      {
        "tag": "ebitda",
        "patterns": [
          "what is ebitda?",
          "what is earnings before interest taxes depreciation and amortization?"
        ],
        "responses": [
          "The portion of profit or loss for the period, before income taxes, interest expenses and depreciation and amortization, which is attributable to the parent."
        ]
      },
      {
        "tag": "gross profit",
        "patterns": [
          "what is gross profit?",
          "what's gross profit?"
        ],
        "responses": [
          "Aggregate revenue less cost of goods and services sold and other operating expenses directly attributable to the revenue generation activity."
        ]
      },
      {
        "tag": "operating expenses",
        "patterns": [
          "what are operating expenses",
          "What are some examples of operating expenses?"
        ],
        "responses": [
          "These are used to determine how likely a company is able to pay its short-term liabilities. These are extremely important because, if a company is unable to do so, it may be forced to declare bankruptcy. Examples include current ratio, current assets / current liabilities, and the quick ratio current assets minus inventory over current liabilities",
          "Operating expenses are costs for operating a business such as sales, marketing, administrative, accounting, R&D, or depreciation"
        ]
      },

      {
        "tag": "income before tax",
        "patterns": [
          "what is income before tax"
        ],
        "responses": [
          "The portion of profit or loss for the period, before income taxes, which is attributable to the parent."

        ]
      },
      {
        "tag": "income tax expense",
        "patterns": [
          "what is income tax expense"
        ],
        "responses": [
          "The amount of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations."          
        ]
      },
      {
        "tag": "interest expense",
        "patterns": [
          "what is interest expense"
        ],
        "responses": [
          "The amount of the cost of borrowed funds accounted for as interest expense."         
        ]
      },
      {
        "tag": "interest income",
        "patterns": [
          "what is interest income"
        ],
        "responses": [
          "The amount of income from non-operating financial securities such as from dividends or bonds"          
        ]
      },
      {
        "tag": "interest income",
        "patterns": [
          "what is interest income"
        ],
        "responses": [
          "The amount of income from non-operating financial securities such as from dividends or bonds"          
        ]
      },
      {
        "tag": "net income",
        "patterns": [
          "what is net income?",
          "What is net profit?",
          "what is total profit/loss?"
        ],
        "responses": [
          "The amount of income from non-operating financial securities such as from dividends or bonds"          
        ]
      },
      {
        "tag": "non interest income",
        "patterns": [
          "what is non-interest income?"
        ],
        "responses": [
          "The total amount of noninterest income for a financial institution which may be derived from: (1) fees and commissions; (2) premiums earned; (3) insurance policy charges; (4) the sale or disposal of assets; and (5) other sources not otherwise specified."          
        ]
      },
      {
        "tag": "non operating income",
        "patterns": [
          "what is non-operating income?"
        ],
        "responses": [
          "The total emount of income related to nonoperating activities, classified as other."          
        ]
      },
      {
        "tag": "research and development",
        "patterns": [
          "what is research & development?",
          "what is research & development expense?",
          "what is r&d expense?",
          "what is r&d"
        ],
        "responses": [
          "The aggregate costs incurred (1) in a planned search or critical investigation aimed at discovery of new knowledge with the hope that such knowledge will be useful in developing a new product or service, a new process or technique, or in bringing about a significant improvement to an existing product or process; or (2) to translate research findings or other knowledge into a plan or design for a new product or process or for a significant improvement to an existing product or process whether intended for sale or the entity's use, during the reporting period charged to research and development projects, including the costs of developing computer software up to the point in time of achieving technological feasibility, and costs allocated in accounting for a business combination to in-process projects deemed to have no alternative future use."          
        ]
      },
      {
        "tag": "selling, general, and administrative",
        "patterns": [
          "what is selling, general, and administrative?",
          "what is selling, general, and administrative expense?",
          "what is SG&A expense?",
          "what is SG&A"
        ],
        "responses": [
          "The aggregate total costs related to selling a firm's product and services, as well as all other general and administrative expenses. Direct selling expenses (for example, credit, warranty, and advertising) are expenses that can be directly linked to the sale of specific products. Indirect selling expenses are expenses that cannot be directly linked to the sale of specific products, for example telephone expenses, Internet, and postal charges. General and administrative expenses include salaries of non-sales personnel, rent, utilities, communication, etc."
        ]
      },
      {
        "tag": "capital lease",
        "patterns": [
          "what are capital lease obligations",
          "what is a capital lease?"
        ],
        "responses": [
          "Present value of lessee's discounted obligation for lease payments from finance lease, classified as noncurrent."
        ]
      },
      {
        "tag": "cash & equivalents",
        "patterns": [
          "what is cash and equivalents?",
          "what is cash & equivalents?",
          "what is cash & equivalents at carrying value?"
        ],
        "responses": [
          "Present value of lessee's discounted obligation for lease payments from finance lease, classified as noncurrent."
        ]
      },
      {
        "tag": "cash & short term investments",
        "patterns": [
          "what is cash and short term investments?",
          "what is cash & short term investments?"
        ],
        "responses": [
          "currency on hand as well as demand deposits with banks or financial institutions. It also includes other kinds of accounts that have the general characteristics of demand deposits in that the customer may deposit additional funds at any time and effectively may withdraw funds at any time without prior notice or penalty. Cash equivalents, excluding items classified as marketable securities, include short-term, highly liquid Investments that are both readily convertible to known amounts of cash, and so near their maturity that they present minimal risk of changes in value because of changes in interest rates. Generally, only investments with maturities of less than a year qualify under that definition. "
        ]
      },
      {
        "tag": "common stock",
        "patterns": [
          "what is common stock",
          "how is common stock calculated"
        ],
        "responses": [
          "The aggregate par or stated value of issued nonredeemable common stock (or common stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable common shares, par value and other disclosure concepts are in another section within stockholders' equity."
        ]
      },
      {"tag":"current accounts payable",
        "patterns": ["what is current accounts payable"],
        "responses":["Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."]}
        ,{"tag":"currentDebt",
          "patterns":["what is currentDebt"],
          "responses":["Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."]
        },
        {"tag":"currentNetReceivables",
          "patterns":["what is currentNetReceivables"],
          "responses":["The total amount due to the entity within one year of the balance sheet date (or one operating cycle, if longer) from outside sources, including trade accounts receivable, notes and loans receivable, as well as any other types of receivables, net of allowances established for the purpose of reducing such receivables to an amount that approximates their net realizable value."]},

          {"tag":"debtLongtermAndShorttermCombinedAmount",
            "patterns":["what is debtLongtermAndShorttermCombinedAmount"],
            "responses":["Represents the aggregate of total long-term debt, including current maturities and short-term debt."]
          },
          {"tag":"deferredRevenue",
            "patterns":"what is deferredRevenue",
            "responses":"Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable."},
            {"tag":"goodwill",
              "patterns":["what is goodwill"],
              "responses":["Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."]},
            {"tag":"intangibleAssets","patterns":"what is intangibleAssets","responses":"Carrying amount of finite-lived intangible assets, indefinite-lived intangible assets and goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets are assets, not including financial assets, lacking physical substance."},
            {"tag":"intangibleAssetsExcludingGoodwill","patterns":"what is intangibleAssetsExcludingGoodwill","responses":"Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."},
            {"tag":"inventory","patterns":"what is inventory","responses":"Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."},
            {"tag":"investments","patterns":"what is investments","responses":"Sum of the carrying amounts as of the balance sheet date of all investments."},
            {"tag":"longTermDebt","patterns":"what is longTermDebt","responses":"Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
            {"tag":"longTermDebtNoncurrent","patterns":"what is longTermDebtNoncurrent","responses":"Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
            {"tag":"longTermInvestments","patterns":"what is longTermInvestments","responses":"The total amount of investments that are intended to be held for an extended period of time (longer than one operating cycle)."},{"tag":"otherCurrentAssets","patterns":"what is otherCurrentAssets","responses":"Amount of current assets classified as other."},
            {"tag":"otherCurrentLiabilities","patterns":"what is otherCurrentLiabilities","responses":"Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."},{"tag":"otherNonCurrentLiabilities","patterns":"what is otherNonCurrentLiabilities","responses":"Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."},
            {"tag":"otherNonCurrrentAssets","patterns":"what is otherNonCurrrentAssets","responses":"Amount of noncurrent assets classified as other."},{"tag":"propertyPlantEquipment","patterns":"what is propertyPlantEquipment","responses":"Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."},
            {"tag":"retainedEarnings","patterns":"what is retainedEarnings","responses":"The cumulative amount of the reporting entity's undistributed earnings or deficit."},
            {"tag":"shortTermDebt","patterns":"what is shortTermDebt","responses":"Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."},{"tag":"shortTermInvestments","patterns":"what is shortTermInvestments","responses":"Amount of investments including trading securities, available-for-sale securities, held-to-maturity securities, and short-term investments classified as other and current."},
            {"tag":"totalAssets","patterns":"what is totalAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
            {"tag":"totalCurrentAssets","patterns":"what is totalCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
            {"tag":"totalCurrentLiabilities","patterns":"what is totalCurrentLiabilities","responses":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."},
            {"tag":"totalLiabilities","patterns":"what is totalLiabilities","responses":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."},
            {"tag":"totalNonCurrentAssets","patterns":"what is totalNonCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer."},
            {"tag":"totalNonCurrentLiabilities","patterns":"what is totalNonCurrentLiabilities","responses":"Amount of obligation due after one year or beyond the normal operating cycle, if longer."},
            {"tag":"totalShareholderEquity","patterns":"what is totalShareholderEquity","responses":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."},
            {"tag":"treasuryStock","patterns":"what is treasuryStock","responses":"The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."},
            {"tag":"capitalExpenditures","patterns":"what is capitalExpenditures","responses":"The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets."},
            {"tag":"cashflowFromFinancing","patterns":"what is cashflowFromFinancing","responses":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."},
            {"tag":"cashflowFromInvestment","patterns":"what is cashflowFromInvestment","responses":"Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."},
            {"tag":"changeInCashAndCashEquivalents","patterns":"what is changeInCashAndCashEquivalents","responses":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."},{"tag":"changeInInventory","patterns":"what is changeInInventory","responses":"The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."},
            {"tag":"changeInOperatingAssets","patterns":"what is changeInOperatingAssets","responses":"The increase (decrease) during the reporting period in the aggregate amount of assets used to generate operating income."},
            {"tag":"changeInOperatingLiabilities","patterns":"what is changeInOperatingLiabilities","responses":"The increase (decrease) during the reporting period in the aggregate amount of liabilities that result from activities that generate operating income."},
            {"tag":"changeInReceivables","patterns":"what is changeInReceivables","responses":"The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."},
            {"tag":"depreciationDepletionAndAmortization","patterns":"what is depreciationDepletionAndAmortization","responses":"The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets."},
            {"tag":"dividendPayout","patterns":"what is dividendPayout","responses":"Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests."},
            {"tag":"dividendPayoutCommonStock","patterns":"what is dividendPayoutCommonStock","responses":"Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."},
            {"tag":"dividendPayoutPreferredStock","patterns":"what is dividendPayoutPreferredStock","responses":"Amount of cash outflow in the form of ordinary dividends to preferred shareholders of the parent entity."},
            {"tag":"operatingCashflow","patterns":"what is operatingCashflow","responses":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."},
            {"tag":"paymentsForOperatingActivities","patterns":"what is paymentsForOperatingActivities","responses":"Total amount of cash paid for operating activities during the current period."},
            {"tag":"paymentsForRepurchaseOfCommonStock","patterns":"what is paymentsForRepurchaseOfCommonStock","responses":"The cash outflow to reacquire common stock during the period."},
            {"tag":"paymentsForRepurchaseOfEquity","patterns":"what is paymentsForRepurchaseOfEquity","responses":"The cash outflow to reacquire common and preferred stock."},
            {"tag":"paymentsForRepurchaseOfPreferredStock","patterns":"what is paymentsForRepurchaseOfPreferredStock","responses":"The cash outflow to reacquire preferred stock during the period."},
            {"tag":"proceedsFromIssuanceOfCommonStock","patterns":"what is proceedsFromIssuanceOfCommonStock","responses":"The cash inflow from the additional capital contribution to the entity."},
            {"tag":"proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","patterns":"what is proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","responses":"The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."},
            {"tag":"proceedsFromIssuanceOfPreferredStock","patterns":"what is proceedsFromIssuanceOfPreferredStock","responses":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholder, which takes precedence over common stockholders in the event of liquidation and from issuance of rights to purchase common shares at a predetermined price."},
            {"tag":"proceedsFromOperatingActivities","patterns":"what is proceedsFromOperatingActivities","responses":"Total amount of cash received from operating activities during the current period."},
            {"tag":"proceedsFromRepaymentsOfShortTermDebt","patterns":"what is proceedsFromRepaymentsOfShortTermDebt","responses":"The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."},
            {"tag":"proceedsFromRepurchaseOfEquity","patterns":"what is proceedsFromRepurchaseOfEquity","responses":"The net cash inflow or outflow resulting from the entity's share transaction."},
            {"tag":"proceedsFromSaleOfTreasuryStock","patterns":"what is proceedsFromSaleOfTreasuryStock","responses":"The cash inflow from the issuance of an equity stock that has been previously reacquired by the entity."},
            {"tag":"current accounts payable","patterns":"how is current accounts payable calculated?","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
            {"tag":"current accounts payable","patterns":"how is current accounts payable calculated?","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
            {"tag":"currentDebt","patterns":"how is currentDebt calculated?","responses":"Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."},
            {"tag":"currentNetReceivables","patterns":"how is currentNetReceivables calculated?","responses":"The total amount due to the entity within one year of the balance sheet date (or one operating cycle, if longer) from outside sources, including trade accounts receivable, notes and loans receivable, as well as any other types of receivables, net of allowances established for the purpose of reducing such receivables to an amount that approximates their net realizable value."},
            {"tag":"debtLongtermAndShorttermCombinedAmount","patterns":"how is debtLongtermAndShorttermCombinedAmount calculated?","responses":"Represents the aggregate of total long-term debt, including current maturities and short-term debt."},
            {"tag":"deferredRevenue","patterns":"how is deferredRevenue calculated?","responses":"Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable."},{"tag":"goodwill","patterns":"how is goodwill calculated?","responses":"Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."},
            {"tag":"intangibleAssets","patterns":"how is intangibleAssets calculated?","responses":"Carrying amount of finite-lived intangible assets, indefinite-lived intangible assets and goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets are assets, not including financial assets, lacking physical substance."},{"tag":"intangibleAssetsExcludingGoodwill","patterns":"how is intangibleAssetsExcludingGoodwill calculated?","responses":"Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."},
            {"tag":"inventory","patterns":"how is inventory calculated?","responses":"Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."},
            {"tag":"investments","patterns":"how is investments calculated?","responses":"Sum of the carrying amounts as of the balance sheet date of all investments."},
            {"tag":"longTermDebt","patterns":"how is longTermDebt calculated?","responses":"Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
            {"tag":"longTermDebtNoncurrent","patterns":"how is longTermDebtNoncurrent calculated?","responses":"Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
            {"tag":"longTermInvestments","patterns":"how is longTermInvestments calculated?","responses":"The total amount of investments that are intended to be held for an extended period of time (longer than one operating cycle)."},
            {"tag":"otherCurrentAssets","patterns":"how is otherCurrentAssets calculated?","responses":"Amount of current assets classified as other."},
            {"tag":"otherCurrentLiabilities","patterns":"how is otherCurrentLiabilities calculated?","responses":"Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."},{"tag":"otherNonCurrentLiabilities","patterns":"how is otherNonCurrentLiabilities calculated?","responses":"Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."},
            {"tag":"otherNonCurrrentAssets","patterns":"how is otherNonCurrrentAssets calculated?","responses":"Amount of noncurrent assets classified as other."},
            {"tag":"propertyPlantEquipment","patterns":"how is propertyPlantEquipment calculated?","responses":"Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."},
            {"tag":"retainedEarnings","patterns":"how is retainedEarnings calculated?","responses":"The cumulative amount of the reporting entity's undistributed earnings or deficit."},
            {"tag":"shortTermDebt","patterns":"how is shortTermDebt calculated?","responses":"Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."},
            {"tag":"shortTermInvestments","patterns":"how is shortTermInvestments calculated?","responses":"Amount of investments including trading securities, available-for-sale securities, held-to-maturity securities, and short-term investments classified as other and current."},
            {"tag":"totalAssets","patterns":"how is totalAssets calculated?","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
            {"tag":"totalCurrentAssets","patterns":"how is totalCurrentAssets calculated?","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
            {"tag":"totalCurrentLiabilities","patterns":"how is totalCurrentLiabilities calculated?","responses":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."},
            {"tag":"totalLiabilities","patterns":"how is totalLiabilities calculated?","responses":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."},
            {"tag":"totalNonCurrentAssets","patterns":"how is totalNonCurrentAssets calculated?","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer."},
            {"tag":"totalNonCurrentLiabilities","patterns":"how is totalNonCurrentLiabilities calculated?","responses":"Amount of obligation due after one year or beyond the normal operating cycle, if longer."},
            {"tag":"totalShareholderEquity","patterns":"how is totalShareholderEquity calculated?","responses":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."},
            {"tag":"treasuryStock","patterns":"how is treasuryStock calculated?","responses":"The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."},{"tag":"capitalExpenditures","patterns":"how is capitalExpenditures calculated?","responses":"The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets."},
            {"tag":"cashflowFromFinancing","patterns":"how is cashflowFromFinancing calculated?","responses":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."},
            {"tag":"cashflowFromInvestment","patterns":"how is cashflowFromInvestment calculated?","responses":"Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."},
            {"tag":"changeInCashAndCashEquivalents","patterns":"how is changeInCashAndCashEquivalents calculated?","responses":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."},
            {"tag":"changeInInventory","patterns":"how is changeInInventory calculated?","responses":"The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."},
            {"tag":"changeInOperatingAssets","patterns":"how is changeInOperatingAssets calculated?","responses":"The increase (decrease) during the reporting period in the aggregate amount of assets used to generate operating income."},
            {"tag":"changeInOperatingLiabilities","patterns":"how is changeInOperatingLiabilities calculated?","responses":"The increase (decrease) during the reporting period in the aggregate amount of liabilities that result from activities that generate operating income."},
            {"tag":"changeInReceivables","patterns":"how is changeInReceivables calculated?","responses":"The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."},{"tag":"depreciationDepletionAndAmortization","patterns":"how is depreciationDepletionAndAmortization calculated?","responses":"The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets."},{"tag":"dividendPayout","patterns":"how is dividendPayout calculated?","responses":"Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests."},
            {"tag":"dividendPayoutCommonStock","patterns":"how is dividendPayoutCommonStock calculated?","responses":"Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."},
            {"tag":"dividendPayoutPreferredStock","patterns":"how is dividendPayoutPreferredStock calculated?","responses":"Amount of cash outflow in the form of ordinary dividends to preferred shareholders of the parent entity."},
            {"tag":"operatingCashflow","patterns":"how is operatingCashflow calculated?","responses":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."},
            {"tag":"paymentsForOperatingActivities","patterns":"how is paymentsForOperatingActivities calculated?","responses":"Total amount of cash paid for operating activities during the current period."},
            {"tag":"paymentsForRepurchaseOfCommonStock","patterns":"how is paymentsForRepurchaseOfCommonStock calculated?","responses":"The cash outflow to reacquire common stock during the period."},
            {"tag":"paymentsForRepurchaseOfEquity","patterns":"how is paymentsForRepurchaseOfEquity calculated?","responses":"The cash outflow to reacquire common and preferred stock."},
            {"tag":"paymentsForRepurchaseOfPreferredStock","patterns":"how is paymentsForRepurchaseOfPreferredStock calculated?","responses":"The cash outflow to reacquire preferred stock during the period."},
            {"tag":"proceedsFromIssuanceOfCommonStock","patterns":"how is proceedsFromIssuanceOfCommonStock calculated?","responses":"The cash inflow from the additional capital contribution to the entity."},
            {"tag":"proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","patterns":"how is proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet calculated?","responses":"The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."},
            {"tag":"proceedsFromIssuanceOfPreferredStock","patterns":"how is proceedsFromIssuanceOfPreferredStock calculated?","responses":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholder, which takes precedence over common stockholders in the event of liquidation and from issuance of rights to purchase common shares at a predetermined price."},
            {"tag":"proceedsFromOperatingActivities","patterns":"how is proceedsFromOperatingActivities calculated?","responses":"Total amount of cash received from operating activities during the current period."},
            {"tag":"proceedsFromRepaymentsOfShortTermDebt","patterns":"how is proceedsFromRepaymentsOfShortTermDebt calculated?","responses":"The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."},{"tag":"proceedsFromRepurchaseOfEquity","patterns":"how is proceedsFromRepurchaseOfEquity calculated?","responses":"The net cash inflow or outflow resulting from the entity's share transaction."},{"tag":"proceedsFromSaleOfTreasuryStock","patterns":"how is proceedsFromSaleOfTreasuryStock calculated?","responses":"The cash inflow from the issuance of an equity stock that has been previously reacquired by the entity."},
            {"tag":"current accounts payable","patterns":"how to interpret current accounts payable","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
            {"tag":"current accounts payable","patterns":"how to interpret current accounts payable","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
            {"tag":"currentDebt","patterns":"how to interpret currentDebt","responses":"Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."},
            {"tag":"currentNetReceivables","patterns":"how to interpret currentNetReceivables","responses":"The total amount due to the entity within one year of the balance sheet date (or one operating cycle, if longer) from outside sources, including trade accounts receivable, notes and loans receivable, as well as any other types of receivables, net of allowances established for the purpose of reducing such receivables to an amount that approximates their net realizable value."},{"tag":"debtLongtermAndShorttermCombinedAmount","patterns":"how to interpret debtLongtermAndShorttermCombinedAmount","responses":"Represents the aggregate of total long-term debt, including current maturities and short-term debt."},
            {"tag":"deferredRevenue","patterns":"how to interpret deferredRevenue","responses":"Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable."},
            {"tag":"goodwill","patterns":"how to interpret goodwill","responses":"Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."},
            {"tag":"intangibleAssets","patterns":"how to interpret intangibleAssets","responses":"Carrying amount of finite-lived intangible assets, indefinite-lived intangible assets and goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets are assets, not including financial assets, lacking physical substance."},
            {"tag":"intangibleAssetsExcludingGoodwill","patterns":"how to interpret intangibleAssetsExcludingGoodwill","responses":"Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."},
            {"tag":"inventory","patterns":"how to interpret inventory","responses":"Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."},
            {"tag":"investments","patterns":"how to interpret investments","responses":"Sum of the carrying amounts as of the balance sheet date of all investments."},
            {"tag":"longTermDebt","patterns":"how to interpret longTermDebt","responses":"Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},{"tag":"longTermDebtNoncurrent","patterns":"how to interpret longTermDebtNoncurrent","responses":"Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
            {"tag":"longTermInvestments","patterns":"how to interpret longTermInvestments","responses":"The total amount of investments that are intended to be held for an extended period of time (longer than one operating cycle)."},
            {"tag":"otherCurrentAssets","patterns":"how to interpret otherCurrentAssets","responses":"Amount of current assets classified as other."},
            {"tag":"otherCurrentLiabilities","patterns":"how to interpret otherCurrentLiabilities","responses":"Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."},{"tag":"otherNonCurrentLiabilities","patterns":"how to interpret otherNonCurrentLiabilities","responses":"Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."},
            {"tag":"otherNonCurrrentAssets","patterns":"how to interpret otherNonCurrrentAssets","responses":"Amount of noncurrent assets classified as other."},{"tag":"propertyPlantEquipment","patterns":"how to interpret propertyPlantEquipment","responses":"Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."},
            {"tag":"retainedEarnings","patterns":"how to interpret retainedEarnings","responses":"The cumulative amount of the reporting entity's undistributed earnings or deficit."},{"tag":"shortTermDebt","patterns":"how to interpret shortTermDebt","responses":"Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."},
            {"tag":"shortTermInvestments","patterns":"how to interpret shortTermInvestments","responses":"Amount of investments including trading securities, available-for-sale securities, held-to-maturity securities, and short-term investments classified as other and current."},
            {"tag":"totalAssets","patterns":"how to interpret totalAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
            {"tag":"totalCurrentAssets","patterns":"how to interpret totalCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
            {"tag":"totalCurrentLiabilities","patterns":"how to interpret totalCurrentLiabilities","responses":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."},
            {"tag":"totalLiabilities","patterns":"how to interpret totalLiabilities","responses":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."},
            {"tag":"totalNonCurrentAssets","patterns":"how to interpret totalNonCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer."},
            {"tag":"totalNonCurrentLiabilities","patterns":"how to interpret totalNonCurrentLiabilities","responses":"Amount of obligation due after one year or beyond the normal operating cycle, if longer."},
            {"tag":"totalShareholderEquity","patterns":"how to interpret totalShareholderEquity","responses":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."},
            {"tag":"treasuryStock","patterns":"how to interpret treasuryStock","responses":"The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."},{
              "tag":"capitalExpenditures","patterns":"how to interpret capitalExpenditures","responses":"The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets."},
              {"tag":"cashflowFromFinancing","patterns":"how to interpret cashflowFromFinancing","responses":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."},
              {"tag":"cashflowFromInvestment","patterns":"how to interpret cashflowFromInvestment","responses":"Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."},
              {"tag":"changeInCashAndCashEquivalents","patterns":"how to interpret changeInCashAndCashEquivalents","responses":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."},
              {"tag":"changeInInventory","patterns":"how to interpret changeInInventory","responses":"The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."},{"tag":"changeInOperatingAssets","patterns":"how to interpret changeInOperatingAssets","responses":"The increase (decrease) during the reporting period in the aggregate amount of assets used to generate operating income."},
              {"tag":"changeInOperatingLiabilities","patterns":"how to interpret changeInOperatingLiabilities","responses":"The increase (decrease) during the reporting period in the aggregate amount of liabilities that result from activities that generate operating income."},
              {"tag":"changeInReceivables","patterns":"how to interpret changeInReceivables","responses":"The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."},
              {"tag":"depreciationDepletionAndAmortization","patterns":"how to interpret depreciationDepletionAndAmortization","responses":"The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets."},
              {"tag":"dividendPayout","patterns":"how to interpret dividendPayout","responses":"Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests."},
              {"tag":"dividendPayoutCommonStock","patterns":"how to interpret dividendPayoutCommonStock","responses":"Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."},
              {"tag":"dividendPayoutPreferredStock","patterns":"how to interpret dividendPayoutPreferredStock","responses":"Amount of cash outflow in the form of ordinary dividends to preferred shareholders of the parent entity."},{"tag":"operatingCashflow","patterns":"how to interpret operatingCashflow","responses":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."},{"tag":"paymentsForOperatingActivities","patterns":"how to interpret paymentsForOperatingActivities","responses":"Total amount of cash paid for operating activities during the current period."},
              {"tag":"paymentsForRepurchaseOfCommonStock","patterns":"how to interpret paymentsForRepurchaseOfCommonStock","responses":"The cash outflow to reacquire common stock during the period."},
              {"tag":"paymentsForRepurchaseOfEquity","patterns":"how to interpret paymentsForRepurchaseOfEquity","responses":"The cash outflow to reacquire common and preferred stock."},{"tag":"paymentsForRepurchaseOfPreferredStock","patterns":"how to interpret paymentsForRepurchaseOfPreferredStock","responses":"The cash outflow to reacquire preferred stock during the period."},
              {"tag":"proceedsFromIssuanceOfCommonStock","patterns":"how to interpret proceedsFromIssuanceOfCommonStock","responses":"The cash inflow from the additional capital contribution to the entity."},
              {"tag":"proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","patterns":"how to interpret proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","responses":"The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."},
              {"tag":"proceedsFromIssuanceOfPreferredStock","patterns":"how to interpret proceedsFromIssuanceOfPreferredStock","responses":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholder, which takes precedence over common stockholders in the event of liquidation and from issuance of rights to purchase common shares at a predetermined price."},
              {"tag":"proceedsFromOperatingActivities","patterns":"how to interpret proceedsFromOperatingActivities","responses":"Total amount of cash received from operating activities during the current period."},{"tag":"proceedsFromRepaymentsOfShortTermDebt","patterns":"how to interpret proceedsFromRepaymentsOfShortTermDebt","responses":"The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."},
              {"tag":"proceedsFromRepurchaseOfEquity","patterns":"how to interpret proceedsFromRepurchaseOfEquity","responses":"The net cash inflow or outflow resulting from the entity's share transaction."},
              {"tag":"proceedsFromSaleOfTreasuryStock","patterns":"how to interpret proceedsFromSaleOfTreasuryStock","responses":"The cash inflow from the issuance of an equity stock that has been previously reacquired by the entity."},
              {"tag":"current accounts payable","patterns":"explain current accounts payable","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
              {"tag":"current accounts payable","patterns":"explain current accounts payable","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
              {"tag":"currentDebt","patterns":"explain currentDebt","responses":"Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."},
              {"tag":"currentNetReceivables","patterns":"explain currentNetReceivables","responses":"The total amount due to the entity within one year of the balance sheet date (or one operating cycle, if longer) from outside sources, including trade accounts receivable, notes and loans receivable, as well as any other types of receivables, net of allowances established for the purpose of reducing such receivables to an amount that approximates their net realizable value."},
              {"tag":"debtLongtermAndShorttermCombinedAmount","patterns":"explain debtLongtermAndShorttermCombinedAmount","responses":"Represents the aggregate of total long-term debt, including current maturities and short-term debt."},
              {"tag":"deferredRevenue","patterns":"explain deferredRevenue","responses":"Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable."},
              {"tag":"goodwill","patterns":"explain goodwill","responses":"Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."},
              {"tag":"intangibleAssets","patterns":"explain intangibleAssets","responses":"Carrying amount of finite-lived intangible assets, indefinite-lived intangible assets and goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets are assets, not including financial assets, lacking physical substance."},
              {"tag":"intangibleAssetsExcludingGoodwill","patterns":"explain intangibleAssetsExcludingGoodwill","responses":"Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."},
              {"tag":"inventory","patterns":"explain inventory","responses":"Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."},
              {"tag":"investments","patterns":"explain investments","responses":"Sum of the carrying amounts as of the balance sheet date of all investments."},
              {"tag":"longTermDebt","patterns":"explain longTermDebt","responses":"Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
              {"tag":"longTermDebtNoncurrent","patterns":"explain longTermDebtNoncurrent","responses":"Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
              {"tag":"longTermInvestments","patterns":"explain longTermInvestments","responses":"The total amount of investments that are intended to be held for an extended period of time (longer than one operating cycle)."},{"tag":"otherCurrentAssets","patterns":"explain otherCurrentAssets","responses":"Amount of current assets classified as other."},
              {"tag":"otherCurrentLiabilities","patterns":"explain otherCurrentLiabilities","responses":"Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."},{"tag":"otherNonCurrentLiabilities","patterns":"explain otherNonCurrentLiabilities","responses":"Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."},
              {"tag":"otherNonCurrrentAssets","patterns":"explain otherNonCurrrentAssets","responses":"Amount of noncurrent assets classified as other."},{"tag":"propertyPlantEquipment","patterns":"explain propertyPlantEquipment","responses":"Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."},
              {"tag":"retainedEarnings","patterns":"explain retainedEarnings","responses":"The cumulative amount of the reporting entity's undistributed earnings or deficit."},{"tag":"shortTermDebt","patterns":"explain shortTermDebt","responses":"Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."},
              {"tag":"shortTermInvestments","patterns":"explain shortTermInvestments","responses":"Amount of investments including trading securities, available-for-sale securities, held-to-maturity securities, and short-term investments classified as other and current."},{"tag":"totalAssets","patterns":"explain totalAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},{"tag":"totalCurrentAssets","patterns":"explain totalCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},{"tag":"totalCurrentLiabilities","patterns":"explain totalCurrentLiabilities","responses":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."},{"tag":"totalLiabilities","patterns":"explain totalLiabilities","responses":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."},{"tag":"totalNonCurrentAssets","patterns":"explain totalNonCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer."},{"tag":"totalNonCurrentLiabilities","patterns":"explain totalNonCurrentLiabilities","responses":"Amount of obligation due after one year or beyond the normal operating cycle, if longer."},{"tag":"totalShareholderEquity","patterns":"explain totalShareholderEquity","responses":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."},{"tag":"treasuryStock","patterns":"explain treasuryStock","responses":"The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."},
              {"tag":"capitalExpenditures","patterns":"explain capitalExpenditures","responses":"The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets."},
              {"tag":"cashflowFromFinancing","patterns":"explain cashflowFromFinancing","responses":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."},
              {"tag":"cashflowFromInvestment","patterns":"explain cashflowFromInvestment","responses":"Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."},
              {"tag":"changeInCashAndCashEquivalents","patterns":"explain changeInCashAndCashEquivalents","responses":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."},
              {"tag":"changeInInventory","patterns":"explain changeInInventory","responses":"The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."},
              {"tag":"changeInOperatingAssets","patterns":"explain changeInOperatingAssets","responses":"The increase (decrease) during the reporting period in the aggregate amount of assets used to generate operating income."},
              {"tag":"changeInOperatingLiabilities","patterns":"explain changeInOperatingLiabilities","responses":"The increase (decrease) during the reporting period in the aggregate amount of liabilities that result from activities that generate operating income."},
              {"tag":"changeInReceivables","patterns":"explain changeInReceivables","responses":"The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."},
              {"tag":"depreciationDepletionAndAmortization","patterns":"explain depreciationDepletionAndAmortization","responses":"The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets."},
              {"tag":"dividendPayout","patterns":"explain dividendPayout","responses":"Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests."},
              {"tag":"dividendPayoutCommonStock","patterns":"explain dividendPayoutCommonStock","responses":"Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."},
              {"tag":"dividendPayoutPreferredStock","patterns":"explain dividendPayoutPreferredStock","responses":"Amount of cash outflow in the form of ordinary dividends to preferred shareholders of the parent entity."},{"tag":"operatingCashflow","patterns":"explain operatingCashflow","responses":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."},{"tag":"paymentsForOperatingActivities","patterns":"explain paymentsForOperatingActivities","responses":"Total amount of cash paid for operating activities during the current period."},{"tag":"paymentsForRepurchaseOfCommonStock","patterns":"explain paymentsForRepurchaseOfCommonStock","responses":"The cash outflow to reacquire common stock during the period."},
              {"tag":"paymentsForRepurchaseOfEquity","patterns":"explain paymentsForRepurchaseOfEquity","responses":"The cash outflow to reacquire common and preferred stock."},
              {"tag":"paymentsForRepurchaseOfPreferredStock","patterns":"explain paymentsForRepurchaseOfPreferredStock","responses":"The cash outflow to reacquire preferred stock during the period."},
              {"tag":"proceedsFromIssuanceOfCommonStock","patterns":"explain proceedsFromIssuanceOfCommonStock","responses":"The cash inflow from the additional capital contribution to the entity."},
              {"tag":"proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","patterns":"explain proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","responses":"The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."},
              {"tag":"proceedsFromIssuanceOfPreferredStock","patterns":"explain proceedsFromIssuanceOfPreferredStock","responses":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholder, which takes precedence over common stockholders in the event of liquidation and from issuance of rights to purchase common shares at a predetermined price."},
              {"tag":"proceedsFromOperatingActivities","patterns":"explain proceedsFromOperatingActivities","responses":"Total amount of cash received from operating activities during the current period."},
              {"tag":"proceedsFromRepaymentsOfShortTermDebt","patterns":"explain proceedsFromRepaymentsOfShortTermDebt","responses":"The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."},
              {"tag":"proceedsFromRepurchaseOfEquity","patterns":"explain proceedsFromRepurchaseOfEquity","responses":"The net cash inflow or outflow resulting from the entity's share transaction."},
              {"tag":"proceedsFromSaleOfTreasuryStock","patterns":"explain proceedsFromSaleOfTreasuryStock","responses":"The cash inflow from the issuance of an equity stock that has been previously reacquired by the entity."},
              {"tag":"current accounts payable","patterns":"please explain current accounts payable","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},{"tag":"current accounts payable","patterns":"please explain current accounts payable","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},
              {"tag":"currentDebt","patterns":"please explain currentDebt","responses":"Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."},
              {"tag":"currentNetReceivables","patterns":"please explain currentNetReceivables","responses":"The total amount due to the entity within one year of the balance sheet date (or one operating cycle, if longer) from outside sources, including trade accounts receivable, notes and loans receivable, as well as any other types of receivables, net of allowances established for the purpose of reducing such receivables to an amount that approximates their net realizable value."},
              {"tag":"debtLongtermAndShorttermCombinedAmount","patterns":"please explain debtLongtermAndShorttermCombinedAmount","responses":"Represents the aggregate of total long-term debt, including current maturities and short-term debt."},
              {"tag":"deferredRevenue","patterns":"please explain deferredRevenue","responses":"Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable."},
              {"tag":"goodwill","patterns":"please explain goodwill","responses":"Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."},
              {"tag":"intangibleAssets","patterns":"please explain intangibleAssets","responses":"Carrying amount of finite-lived intangible assets, indefinite-lived intangible assets and goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets are assets, not including financial assets, lacking physical substance."},
              {"tag":"intangibleAssetsExcludingGoodwill","patterns":"please explain intangibleAssetsExcludingGoodwill","responses":"Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."},
              {"tag":"inventory","patterns":"please explain inventory","responses":"Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."},
              {"tag":"investments","patterns":"please explain investments","responses":"Sum of the carrying amounts as of the balance sheet date of all investments."},{"tag":"longTermDebt","patterns":"please explain longTermDebt","responses":"Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},{"tag":"longTermDebtNoncurrent","patterns":"please explain longTermDebtNoncurrent","responses":"Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
              {"tag":"longTermInvestments","patterns":"please explain longTermInvestments","responses":"The total amount of investments that are intended to be held for an extended period of time (longer than one operating cycle)."},
              {"tag":"otherCurrentAssets","patterns":"please explain otherCurrentAssets","responses":"Amount of current assets classified as other."},{"tag":"otherCurrentLiabilities","patterns":"please explain otherCurrentLiabilities","responses":"Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."},
              {"tag":"otherNonCurrentLiabilities","patterns":"please explain otherNonCurrentLiabilities","responses":"Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."},
              {"tag":"otherNonCurrrentAssets","patterns":"please explain otherNonCurrrentAssets","responses":"Amount of noncurrent assets classified as other."},
              {"tag":"propertyPlantEquipment","patterns":"please explain propertyPlantEquipment","responses":"Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."},
              {"tag":"retainedEarnings","patterns":"please explain retainedEarnings","responses":"The cumulative amount of the reporting entity's undistributed earnings or deficit."},
              {"tag":"shortTermDebt","patterns":"please explain shortTermDebt","responses":"Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."},{"tag":"shortTermInvestments","patterns":"please explain shortTermInvestments","responses":"Amount of investments including trading securities, available-for-sale securities, held-to-maturity securities, and short-term investments classified as other and current."},
              {"tag":"totalAssets","patterns":"please explain totalAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},{"tag":"totalCurrentAssets","patterns":"please explain totalCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},{"tag":"totalCurrentLiabilities","patterns":"please explain totalCurrentLiabilities","responses":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."},
              {"tag":"totalLiabilities","patterns":"please explain totalLiabilities","responses":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."},
              {"tag":"totalNonCurrentAssets","patterns":"please explain totalNonCurrentAssets","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer."},
              {"tag":"totalNonCurrentLiabilities","patterns":"please explain totalNonCurrentLiabilities","responses":"Amount of obligation due after one year or beyond the normal operating cycle, if longer."},
              {"tag":"totalShareholderEquity","patterns":"please explain totalShareholderEquity","responses":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."},{"tag":"treasuryStock","patterns":"please explain treasuryStock","responses":"The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."},
              {"tag":"capitalExpenditures","patterns":"please explain capitalExpenditures","responses":"The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets."},
              {"tag":"cashflowFromFinancing","patterns":"please explain cashflowFromFinancing","responses":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."},
              {"tag":"cashflowFromInvestment","patterns":"please explain cashflowFromInvestment","responses":"Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."},
              {"tag":"changeInCashAndCashEquivalents","patterns":"please explain changeInCashAndCashEquivalents","responses":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."},
              {"tag":"changeInInventory","patterns":"please explain changeInInventory","responses":"The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."},
              {"tag":"changeInOperatingAssets","patterns":"please explain changeInOperatingAssets","responses":"The increase (decrease) during the reporting period in the aggregate amount of assets used to generate operating income."},
              {"tag":"changeInOperatingLiabilities","patterns":"please explain changeInOperatingLiabilities","responses":"The increase (decrease) during the reporting period in the aggregate amount of liabilities that result from activities that generate operating income."},
              {"tag":"changeInReceivables","patterns":"please explain changeInReceivables","responses":"The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."},{"tag":"depreciationDepletionAndAmortization","patterns":"please explain depreciationDepletionAndAmortization","responses":"The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets."},{"tag":"dividendPayout","patterns":"please explain dividendPayout","responses":"Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests."},
              {"tag":"dividendPayoutCommonStock","patterns":"please explain dividendPayoutCommonStock","responses":"Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."},
              {"tag":"dividendPayoutPreferredStock","patterns":"please explain dividendPayoutPreferredStock","responses":"Amount of cash outflow in the form of ordinary dividends to preferred shareholders of the parent entity."},
              {"tag":"operatingCashflow","patterns":"please explain operatingCashflow","responses":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."},{"tag":"paymentsForOperatingActivities","patterns":"please explain paymentsForOperatingActivities","responses":"Total amount of cash paid for operating activities during the current period."},
              {"tag":"paymentsForRepurchaseOfCommonStock","patterns":"please explain paymentsForRepurchaseOfCommonStock","responses":"The cash outflow to reacquire common stock during the period."},
              {"tag":"paymentsForRepurchaseOfEquity","patterns":"please explain paymentsForRepurchaseOfEquity","responses":"The cash outflow to reacquire common and preferred stock."},
              {"tag":"paymentsForRepurchaseOfPreferredStock","patterns":"please explain paymentsForRepurchaseOfPreferredStock","responses":"The cash outflow to reacquire preferred stock during the period."},
              {"tag":"proceedsFromIssuanceOfCommonStock","patterns":"please explain proceedsFromIssuanceOfCommonStock","responses":"The cash inflow from the additional capital contribution to the entity."},
              {"tag":"proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","patterns":"please explain proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","responses":"The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."},
              {"tag":"proceedsFromIssuanceOfPreferredStock","patterns":"please explain proceedsFromIssuanceOfPreferredStock","responses":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholder, which takes precedence over common stockholders in the event of liquidation and from issuance of rights to purchase common shares at a predetermined price."},
              {"tag":"proceedsFromOperatingActivities","patterns":"please explain proceedsFromOperatingActivities","responses":"Total amount of cash received from operating activities during the current period."},
              {"tag":"proceedsFromRepaymentsOfShortTermDebt","patterns":"please explain proceedsFromRepaymentsOfShortTermDebt","responses":"The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."},{"tag":"proceedsFromRepurchaseOfEquity","patterns":"please explain proceedsFromRepurchaseOfEquity","responses":"The net cash inflow or outflow resulting from the entity's share transaction."},{"tag":"proceedsFromSaleOfTreasuryStock","patterns":"please explain proceedsFromSaleOfTreasuryStock","responses":"The cash inflow from the issuance of an equity stock that has been previously reacquired by the entity."},
              {"tag":"current accounts payable","patterns":"can you tell me what current accounts payable is?","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},{"tag":"current accounts payable","patterns":"can you tell me what current accounts payable is?","responses":"Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."},{"tag":"currentDebt","patterns":"can you tell me what currentDebt is?","responses":"Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."},
              {"tag":"currentNetReceivables","patterns":"can you tell me what currentNetReceivables is?","responses":"The total amount due to the entity within one year of the balance sheet date (or one operating cycle, if longer) from outside sources, including trade accounts receivable, notes and loans receivable, as well as any other types of receivables, net of allowances established for the purpose of reducing such receivables to an amount that approximates their net realizable value."},{"tag":"debtLongtermAndShorttermCombinedAmount","patterns":"can you tell me what debtLongtermAndShorttermCombinedAmount is?","responses":"Represents the aggregate of total long-term debt, including current maturities and short-term debt."},
              {"tag":"deferredRevenue","patterns":"can you tell me what deferredRevenue is?","responses":"Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable."},
              {"tag":"goodwill","patterns":"can you tell me what goodwill is?","responses":"Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."},
              {"tag":"intangibleAssets","patterns":"can you tell me what intangibleAssets is?","responses":"Carrying amount of finite-lived intangible assets, indefinite-lived intangible assets and goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets are assets, not including financial assets, lacking physical substance."},{"tag":"intangibleAssetsExcludingGoodwill","patterns":"can you tell me what intangibleAssetsExcludingGoodwill is?","responses":"Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."},
              {"tag":"inventory","patterns":"can you tell me what inventory is?","responses":"Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."},
              {"tag":"investments","patterns":"can you tell me what investments is?","responses":"Sum of the carrying amounts as of the balance sheet date of all investments."},
              {"tag":"longTermDebt","patterns":"can you tell me what longTermDebt is?","responses":"Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
              {"tag":"longTermDebtNoncurrent","patterns":"can you tell me what longTermDebtNoncurrent is?","responses":"Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."},
              {"tag":"longTermInvestments","patterns":"can you tell me what longTermInvestments is?","responses":"The total amount of investments that are intended to be held for an extended period of time (longer than one operating cycle)."},
              {"tag":"otherCurrentAssets","patterns":"can you tell me what otherCurrentAssets is?","responses":"Amount of current assets classified as other."},
              {"tag":"otherCurrentLiabilities","patterns":"can you tell me what otherCurrentLiabilities is?","responses":"Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."},
              {"tag":"otherNonCurrentLiabilities","patterns":"can you tell me what otherNonCurrentLiabilities is?","responses":"Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."},
              {"tag":"otherNonCurrrentAssets","patterns":"can you tell me what otherNonCurrrentAssets is?","responses":"Amount of noncurrent assets classified as other."},
              {"tag":"propertyPlantEquipment","patterns":"can you tell me what propertyPlantEquipment is?","responses":"Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."},
              {"tag":"retainedEarnings","patterns":"can you tell me what retainedEarnings is?","responses":"The cumulative amount of the reporting entity's undistributed earnings or deficit."},
              {"tag":"shortTermDebt","patterns":"can you tell me what shortTermDebt is?","responses":"Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."},
              {"tag":"shortTermInvestments","patterns":"can you tell me what shortTermInvestments is?","responses":"Amount of investments including trading securities, available-for-sale securities, held-to-maturity securities, and short-term investments classified as other and current."},
              {"tag":"totalAssets","patterns":"can you tell me what totalAssets is?","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},
              {"tag":"totalCurrentAssets","patterns":"can you tell me what totalCurrentAssets is?","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."},{"tag":"totalCurrentLiabilities","patterns":"can you tell me what totalCurrentLiabilities is?","responses":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."},{"tag":"totalLiabilities","patterns":"can you tell me what totalLiabilities is?","responses":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."},
              {"tag":"totalNonCurrentAssets","patterns":"can you tell me what totalNonCurrentAssets is?","responses":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer."},{"tag":"totalNonCurrentLiabilities","patterns":"can you tell me what totalNonCurrentLiabilities is?","responses":"Amount of obligation due after one year or beyond the normal operating cycle, if longer."},
              {"tag":"totalShareholderEquity","patterns":"can you tell me what totalShareholderEquity is?","responses":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."},
              {"tag":"treasuryStock","patterns":"can you tell me what treasuryStock is?","responses":"The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."},
              {"tag":"capitalExpenditures","patterns":"can you tell me what capitalExpenditures is?","responses":"The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets."},
              {"tag":"cashflowFromFinancing","patterns":"can you tell me what cashflowFromFinancing is?","responses":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."},
              {"tag":"cashflowFromInvestment","patterns":"can you tell me what cashflowFromInvestment is?","responses":"Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."},
              {"tag":"changeInCashAndCashEquivalents","patterns":"can you tell me what changeInCashAndCashEquivalents is?","responses":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."},
              {"tag":"changeInInventory","patterns":"can you tell me what changeInInventory is?","responses":"The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."},{"tag":"changeInOperatingAssets","patterns":"can you tell me what changeInOperatingAssets is?","responses":"The increase (decrease) during the reporting period in the aggregate amount of assets used to generate operating income."},
              {"tag":"changeInOperatingLiabilities","patterns":"can you tell me what changeInOperatingLiabilities is?","responses":"The increase (decrease) during the reporting period in the aggregate amount of liabilities that result from activities that generate operating income."},
              {"tag":"changeInReceivables","patterns":"can you tell me what changeInReceivables is?","responses":"The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."},{"tag":"depreciationDepletionAndAmortization","patterns":"can you tell me what depreciationDepletionAndAmortization is?","responses":"The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets."},
              {"tag":"dividendPayout","patterns":"can you tell me what dividendPayout is?","responses":"Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests."},
              {"tag":"dividendPayoutCommonStock","patterns":"can you tell me what dividendPayoutCommonStock is?","responses":"Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."},
              {"tag":"dividendPayoutPreferredStock","patterns":"can you tell me what dividendPayoutPreferredStock is?","responses":"Amount of cash outflow in the form of ordinary dividends to preferred shareholders of the parent entity."},
              {"tag":"operatingCashflow","patterns":"can you tell me what operatingCashflow is?","responses":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."},{"tag":"paymentsForOperatingActivities","patterns":"can you tell me what paymentsForOperatingActivities is?","responses":"Total amount of cash paid for operating activities during the current period."},
              {"tag":"paymentsForRepurchaseOfCommonStock","patterns":"can you tell me what paymentsForRepurchaseOfCommonStock is?","responses":"The cash outflow to reacquire common stock during the period."},
              {"tag":"paymentsForRepurchaseOfEquity","patterns":"can you tell me what paymentsForRepurchaseOfEquity is?","responses":"The cash outflow to reacquire common and preferred stock."},
              {"tag":"paymentsForRepurchaseOfPreferredStock","patterns":"can you tell me what paymentsForRepurchaseOfPreferredStock is?","responses":"The cash outflow to reacquire preferred stock during the period."},
              {"tag":"proceedsFromIssuanceOfCommonStock","patterns":"can you tell me what proceedsFromIssuanceOfCommonStock is?","responses":"The cash inflow from the additional capital contribution to the entity."},
              {"tag":"proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet","patterns":"can you tell me what proceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet is?","responses":"The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."},
              {"tag":"proceedsFromIssuanceOfPreferredStock","patterns":"can you tell me what proceedsFromIssuanceOfPreferredStock is?","responses":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholder, which takes precedence over common stockholders in the event of liquidation and from issuance of rights to purchase common shares at a predetermined price."},
              {"tag":"proceedsFromOperatingActivities","patterns":"can you tell me what proceedsFromOperatingActivities is?","responses":"Total amount of cash received from operating activities during the current period."},
              {"tag":"proceedsFromRepaymentsOfShortTermDebt","patterns":"can you tell me what proceedsFromRepaymentsOfShortTermDebt is?","responses":"The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."},
              {"tag":"proceedsFromRepurchaseOfEquity","patterns":"can you tell me what proceedsFromRepurchaseOfEquity is?","responses":"The net cash inflow or outflow resulting from the entity's share transaction."},{"tag":"proceedsFromSaleOfTreasuryStock","patterns":"can you tell me what proceedsFromSaleOfTreasuryStock is?","responses":"The cash inflow from the issuance of an equity stock that has been previously reacquired by the entity."},
              {"tag":"liquidity ratios","patterns":"what is liquidity ratios","responses":"Liquidity ratios are financial ratios that measure a company’s ability to repay both short- and long-term obligations. Common ratios are the current ratio, cash ratio, quick ratio, and operating cash flow ratio"},
              {"tag":"leverage ratios","patterns":"what is leverage ratios","responses":"Leverage measure the amount of capital that comes from debt. In other words, leverage financial ratios are used to evaluate a company’s debt levels. Common leverage ratios include debt to assets, debt to equity, and  interest coverage ratio"},{"tag":"efficiency ratios","patterns":"what is efficiency ratios","responses":"Efficiency ratios, also known as activity financial ratios, are used to measure how well a company is utilizing its assets and resources. Common efficiency ratios include asset turnover, inventory turnover, payables turnover, receivables turnover, DSO, DPO, DIO"},
              {"tag":"profitability ratios","patterns":"what is profitability ratios","responses":"profitability ratios measure a company’s ability to generate income relative to revenue, balance sheet assets, operating costs, and equity. Common profitability financial ratios include gross margin, operating margin, ROE, & ROA"},
              {"tag":"market value ratios","patterns":"what is market value ratios","responses":"Market value ratios are used to evaluate the share price of a company’s stock. Common market value ratios include book value per share, dividend yield, P//E, eps, ev//ebit, or ev//ebitda"},{"tag":"current ratio","patterns":"what is current ratio","responses":"current ratio measures a company’s ability to pay off short-term liabilities with current assets. It's equal to current assets // current liabilities"},
              {"tag":"cash ratio","patterns":"what is cash ratio","responses":"cash ratio measures a company’s ability to pay off short-term liabilities with cash and cash equivalents. It's equal to cash and equivalents // current liabilities"},{"tag":"quick ratio","patterns":"what is quick ratio","responses":"quick ratio measures a company’s ability to pay off short-term liabilities with current assets excluding inventory. It's equal to current assets minus inventory // current liabilities"},{"tag":"operating cash flow ratio","patterns":"what is operating cash flow ratio","responses":"operating cash flow ratio  a measure of the number of times a company can pay off current liabilities with the cash generated in a given period. It's equal to operating cash flow // current liabilities"},{"tag":"debt ratio","patterns":"what is debt ratio","responses":"debt ratio measures the relative amount of a company’s assets that are provided from debt. It's equal to total debt // total assets"},
              {"tag":"debt to equity ratio","patterns":"what is debt to equity ratio","responses":"debt to equity ratio calculates the weight of total debt and financial liabilities against shareholders’ equity. It's equal to total liabilities // total equity"},
              {"tag":"interest coverage ratio","patterns":"what is interest coverage ratio","responses":"interest coverage ratio shows how easily a company can pay its interest expense. It's equal to operating income // interest expenses"},{"tag":"asset turnover ratio","patterns":"what is asset turnover ratio","responses":"asset turnover ratio measures a company’s ability to generate sales from assets. It's equal to Net sales // Average total assets"},
              {"tag":"inventory turnover ratio","patterns":"what is inventory turnover ratio","responses":"inventory turnover ratio measures how many times a company’s inventory is sold and replaced over a given period. It's equal to cost of goods sold // average inventory"},
              {"tag":"receivable turnover ratio","patterns":"what is receivable turnover ratio","responses":"receivable turnover ratio measures how many times a company can turn receivables into cash over a given period. It's equal to Net credit sales // Average accounts receivable"},
              {"tag":"credit sales","patterns":"what is credit sales","responses":"Credit sales represent the proportion of net sales that were paid for in credit rather than cash"},
              {"tag":"gross margin ratio","patterns":"what is gross margin ratio","responses":"gross margin ratio compares the gross profit of a company to its net sales to show how much profit a company makes after paying its cost of goods sold. It's equal to gross profit // net sales"},{"tag":"operating margin","patterns":"what is operating margin","responses":"operating margin compares the operating income of a company to its net sales to determine operating efficiency. It's equal to operating income // net sales"},{"tag":"roa","patterns":"what is roa","responses":"roa measures how efficiently a company is using its assets to generate profit. It's equal to net income // total assets"},
              {"tag":"roe","patterns":"what is roe","responses":"roe measures how efficiently a company is using its equity to generate profit. It's equal to net income // shareholders equity"},
              {"tag":"book value per share ","patterns":"what is book value per share ","responses":"book value per share  calculates the per-share value of a company based on the equity available to shareholders. It's equal to (Shareholder’s equity – Preferred equity) // Total common shares outstanding"},
              {"tag":"dividend yield ratio","patterns":"what is dividend yield ratio","responses":"dividend yield ratio measures the amount of dividends attributed to shareholders relative to the market value per share. It's equal to Dividend per share // Share price"},{"tag":"eps","patterns":"what is eps","responses":"eps measures the amount of net income earned for each share outstanding. It's equal to Net earnings // Total shares outstanding"},
              {"tag":"price to earnings","patterns":"what is price to earnings","responses":"price to earnings compares a company’s share price to its earnings per share. It's equal to Share price // Earnings per share"},{"tag":"fcf","patterns":"what is fcf","responses":"fcf measures the amount of  cash generated for the company's core business"},
              {"tag":"ccc","patterns":"what is ccc","responses":"ccc Stands for the cash conversion cycle. Its calculated as DIO + DSO - DPO. It shows the length of time it takes a company to convert its investment into working capital into cash flows from sales"},{"tag":"beniesh m-score","patterns":"what is beniesh m-score","responses":"beniesh m-score is a mathematical model that uses eight financial ratios weighted by coefficients to identify whether a company has manipulated its profits. If the score is greater than -1.78, earnings manipulation is likely. A score between -2.22 and -1.78 indicates that earnings manipulation is possible, and a score less than -2.22 indicates an unlikely chance of earnings manipulation"},{"tag":"leverage index","patterns":"what is leverage index","responses":"leverage index is measured as total debt relative to total assets. An increase in leverage creates an incentive to manipulate profits in order to meet debt covenants."},
              {"tag":"ebitda margin","patterns":"what is ebitda margin","responses":"the percentage of ebitda of total revenue"},{"tag":"asset quality index","patterns":"what is asset quality index","responses":"An increase in long term assets (for example, the capitalisation of costs), other than property plant and equipment, relative to total assets indicates that a firm has potentially increased its involvement in cost deferral to inflate profits."},{"tag":"dividend payout ratio","patterns":"what is dividend payout ratio","responses":"the ratio of the total amount of dividends paid out to shareholders relative to the net income of the company."},{"tag":"net working capital","patterns":"what is net working capital","responses":"The difference between the current assets and current laibilities"},
              {"tag":"change in net working capital","patterns":"what is change in net working capital","responses":"the difference between net working capital in period t and net working capital in period t-1"},{"tag":"altmans z-score","patterns":"what is altmans z-score","responses":"A formula for predicting the liklihood of bankruptcy. Anything less than 1.81 is considered the \"distress zone\", anything between 1.81 and 2.99 is considered a \"grey\" zone, and anything greater than 2.99 is considered the \"safe\" zone."},{"tag":"roic","patterns":"what is roic","responses":"Return on invested capital (ROIC) is the amount of money a company makes that is above the average cost it pays for its debt and equity capital. It's equal to operating income // total capital"},{"tag":"croic","patterns":"what is croic","responses":"The percentage return of free cash flow to firm divided by invested capital"},{"tag":"days sale receivable index","patterns":"what is days sale receivable index","responses":"shows our DSO has changed from one period to the next. A large increase in receivable days might suggest accelerated revenue recognition to inflate profits"},{"tag":"gross margin index","patterns":"what is gross margin index","responses":"Shows how gross margin has changed from one period to the next.  deteriorating gross margin sends a negative signal about a firm’s prospects and creates an incentive to inflate profits."},{"tag":"fcff","patterns":"what is fcff","responses":"The free cash flow generated by a company before taking into account interest payments. It shows the total cash generated for both equity and debt investors"},{"tag":"fcfe","patterns":"what is fcfe","responses":"The free cash flow generated by a company after taking into account interest payments. It shows the total cash generated for just equity investors"},{"tag":"cgo","patterns":"what is cgo","responses":"Cash generated from operations shows "},{"tag":"sg&a index","patterns":"what is sg&a index","responses":" Analysts might interpret a disproportionate increase in SG&A relative to sales as a negative signal about a firm’s future prospects, thereby creating an inventive to inflate profits."},{"tag":"depreciation index","patterns":"what is depreciation index","responses":"a change in depreciation relative to fixed assets today vs the prior period. A falling level of depreciation relative to net fixed assets raises the possibility that a firm has revised upwards the estimated useful life of assets, or adopted a new method that is income increasing."},{"tag":"equity multiplier","patterns":"what is equity multiplier","responses":"Total assets divided by total shareholders equity. A higher value generally means the company is using more debt to finance its activities, which increases risk."},{"tag":"earnings quality","patterns":"what is earnings quality","responses":"Calculated as cash flow from operations divided by net income. A ratio higher than 1 indicates high earnings quality, and a ratio less than 1 indicates low-quality"},{"tag":"pvgo","patterns":"what is pvgo","responses":"Present value of growth opportunities. It represents the amount of a companys stock value that corresponds to expected growth in earnings. It's equal to share price - ( eps // cost of capital)"},{"tag":"oc","patterns":"what is oc","responses":"Operating cycle is equal to DIO + DSO. It represenrs the number of days it takes a business to receive inventory, sell inventory, and collect cash from the sale, not taking into account the number days the company takes to pay its own suppliers."},{"tag":"pvgo to share price","patterns":"what is pvgo to share price","responses":"The ratio of present value of growth opportunities relative to the share price."},{"tag":"ev ","patterns":"what is ev ","responses":"Enterprise value is the total market cap plus net debt. It measures the total value of a company taking into account both equity and debt financing."},{"tag":"retention ratio","patterns":"what is retention ratio","responses":"The proportion of earnings that are retained and not paid out as dividends relative to total earnings."},{"tag":"p//ocf","patterns":"what is p//ocf","responses":"The ratio of share price to cash flow from operations per share. A lower multiple indicates a stock may be undervalued. Some analysts prefer this compared to price to earnings since earnings can more easily be manipulated"},{"tag":"p//b","patterns":"what is p//b","responses":"The ratio of the market price per share to book value of equity per share"},{"tag":"ev//ebit","patterns":"what is ev//ebit","responses":"The ratio of enterprise value to earnings before interest and taxes.A lower value may indicate the company is undervalued."},{"tag":"ev//ebitda","patterns":"what is ev//ebitda","responses":"The ratio of enterprise value to earnings before interest, taxes, depreciation, and amortization. A lower value may indicate the company is undervalued."},{"tag":"noncash charges to pp&e","patterns":"what is noncash charges to pp&e","responses":"The ratio of non cash expenses such as deprecation to the net book value of long-term tangible assets such as property, plant equipment"},{"tag":"effective tax rate","patterns":"what is effective tax rate","responses":"The rato of tax expense relative to earnings before taxes. It shows proprtion of their earnings that go towards paying taxes."},{"tag":"dso","patterns":"what is dso","responses":"Days Sales Outstanding (DSO) represents the average number of days it takes credit sales to be converted into cash or how long it takes a company to collect its accounts receivable. It can be calculated by dividing the total accounts receivable during a certain time frame by the total net credit sales. This number is then multiplied by the number of days in the period of time."},{"tag":"dpo","patterns":"what is dpo","responses":"Days payable outstanding (DPO) is a financial ratio that indicates the average time (in days) that a company takes to pay its bills and invoices to its trade creditors, which may include suppliers, vendors, or financiers. It's calculated by multiplying accounts payable by the number of days in the period and dividing by cost of goods sold."},{"tag":"dio","patterns":"what is dio","responses":"Days inventory outstanding (DPO)indicates the average number of days a company holds its inventory before selling it It's calculated by multiplying inventory by the number of days in the period and dividing by cost of goods sold."},{"tag":"total capital","patterns":"what is total capital","responses":"Total capital is defined as total debt plus total shareholders equity. It represents the total book value of financing sources the company has."},{"tag":"liquidity ratios","patterns":"how is liquidity ratios calculated?","responses":"Liquidity ratios are financial ratios that measure a company’s ability to repay both short- and long-term obligations. Common ratios are the current ratio, cash ratio, quick ratio, and operating cash flow ratio"},{"tag":"leverage ratios","patterns":"how is leverage ratios calculated?","responses":"Leverage measure the amount of capital that comes from debt. In other words, leverage financial ratios are used to evaluate a company’s debt levels. Common leverage ratios include debt to assets, debt to equity, and  interest coverage ratio"},{"tag":"efficiency ratios","patterns":"how is efficiency ratios calculated?","responses":"Efficiency ratios, also known as activity financial ratios, are used to measure how well a company is utilizing its assets and resources. Common efficiency ratios include asset turnover, inventory turnover, payables turnover, receivables turnover, DSO, DPO, DIO"},{"tag":"profitability ratios","patterns":"how is profitability ratios calculated?","responses":"profitability ratios measure a company’s ability to generate income relative to revenue, balance sheet assets, operating costs, and equity. Common profitability financial ratios include gross margin, operating margin, ROE, & ROA"},{"tag":"market value ratios","patterns":"how is market value ratios calculated?","responses":"Market value ratios are used to evaluate the share price of a company’s stock. Common market value ratios include book value per share, dividend yield, P//E, eps, ev//ebit, or ev//ebitda"},{"tag":"current ratio","patterns":"how is current ratio calculated?","responses":"current ratio measures a company’s ability to pay off short-term liabilities with current assets. It's equal to current assets // current liabilities"},{"tag":"cash ratio","patterns":"how is cash ratio calculated?","responses":"cash ratio measures a company’s ability to pay off short-term liabilities with cash and cash equivalents. It's equal to cash and equivalents // current liabilities"},{"tag":"quick ratio","patterns":"how is quick ratio calculated?","responses":"quick ratio measures a company’s ability to pay off short-term liabilities with current assets excluding inventory. It's equal to current assets minus inventory // current liabilities"},{"tag":"operating cash flow ratio","patterns":"how is operating cash flow ratio calculated?","responses":"operating cash flow ratio  a measure of the number of times a company can pay off current liabilities with the cash generated in a given period. It's equal to operating cash flow // current liabilities"},{"tag":"debt ratio","patterns":"how is debt ratio calculated?","responses":"debt ratio measures the relative amount of a company’s assets that are provided from debt. It's equal to total debt // total assets"},{"tag":"debt to equity ratio","patterns":"how is debt to equity ratio calculated?","responses":"debt to equity ratio calculates the weight of total debt and financial liabilities against shareholders’ equity. It's equal to total liabilities // total equity"},{"tag":"interest coverage ratio","patterns":"how is interest coverage ratio calculated?","responses":"interest coverage ratio shows how easily a company can pay its interest expense. It's equal to operating income // interest expenses"},{"tag":"asset turnover ratio","patterns":"how is asset turnover ratio calculated?","responses":"asset turnover ratio measures a company’s ability to generate sales from assets. It's equal to Net sales // Average total assets"},{"tag":"inventory turnover ratio","patterns":"how is inventory turnover ratio calculated?","responses":"inventory turnover ratio measures how many times a company’s inventory is sold and replaced over a given period. It's equal to cost of goods sold // average inventory"},{"tag":"receivable turnover ratio","patterns":"how is receivable turnover ratio calculated?","responses":"receivable turnover ratio measures how many times a company can turn receivables into cash over a given period. It's equal to Net credit sales // Average accounts receivable"},{"tag":"credit sales","patterns":"how is credit sales calculated?","responses":"Credit sales represent the proportion of net sales that were paid for in credit rather than cash"},{"tag":"gross margin ratio","patterns":"how is gross margin ratio calculated?","responses":"gross margin ratio compares the gross profit of a company to its net sales to show how much profit a company makes after paying its cost of goods sold. It's equal to gross profit // net sales"},{"tag":"operating margin","patterns":"how is operating margin calculated?","responses":"operating margin compares the operating income of a company to its net sales to determine operating efficiency. It's equal to operating income // net sales"},{"tag":"roa","patterns":"how is roa calculated?","responses":"roa measures how efficiently a company is using its assets to generate profit. It's equal to net income // total assets"},{"tag":"roe","patterns":"how is roe calculated?","responses":"roe measures how efficiently a company is using its equity to generate profit. It's equal to net income // shareholders equity"},{"tag":"book value per share ","patterns":"how is book value per share  calculated?","responses":"book value per share  calculates the per-share value of a company based on the equity available to shareholders. It's equal to (Shareholder’s equity – Preferred equity) // Total common shares outstanding"},{"tag":"dividend yield ratio","patterns":"how is dividend yield ratio calculated?","responses":"dividend yield ratio measures the amount of dividends attributed to shareholders relative to the market value per share. It's equal to Dividend per share // Share price"},{"tag":"eps","patterns":"how is eps calculated?","responses":"eps measures the amount of net income earned for each share outstanding. It's equal to Net earnings // Total shares outstanding"},{"tag":"price to earnings","patterns":"how is price to earnings calculated?","responses":"price to earnings compares a company’s share price to its earnings per share. It's equal to Share price // Earnings per share"},{"tag":"fcf","patterns":"how is fcf calculated?","responses":"fcf measures the amount of  cash generated for the company's core business"},{"tag":"ccc","patterns":"how is ccc calculated?","responses":"ccc Stands for the cash conversion cycle. Its calculated as DIO + DSO - DPO. It shows the length of time it takes a company to convert its investment into working capital into cash flows from sales"},{"tag":"beniesh m-score","patterns":"how is beniesh m-score calculated?","responses":"beniesh m-score  is a mathematical model that uses eight financial ratios weighted by coefficients to identify whether a company has manipulated its profits. If the score is greater than -1.78, earnings manipulation is likely. A score between -2.22 and -1.78 indicates that earnings manipulation is possible, and a score less than -2.22 indicates an unlikely chance of earnings manipulation"},{"tag":"leverage index","patterns":"how is leverage index calculated?","responses":"leverage index is measured as total debt relative to total assets. An increase in leverage creates an incentive to manipulate profits in order to meet debt covenants."},{"tag":"ebitda margin","patterns":"how is ebitda margin calculated?","responses":"the percentage of ebitda of total revenue"},{"tag":"asset quality index","patterns":"how is asset quality index calculated?","responses":"An increase in long term assets (for example, the capitalisation of costs), other than property plant and equipment, relative to total assets indicates that a firm has potentially increased its involvement in cost deferral to inflate profits."},{"tag":"dividend payout ratio","patterns":"how is dividend payout ratio calculated?","responses":"the ratio of the total amount of dividends paid out to shareholders relative to the net income of the company."},{"tag":"net working capital","patterns":"how is net working capital calculated?","responses":"The difference between the current assets and current laibilities"},{"tag":"change in net working capital","patterns":"how is change in net working capital calculated?","responses":"the difference between net working capital in period t and net working capital in period t-1"},{"tag":"altmans z-score","patterns":"how is altmans z-score calculated?","responses":"A formula for predicting the liklihood of bankruptcy. Anything less than 1.81 is considered the \"distress zone\", anything between 1.81 and 2.99 is considered a \"grey\" zone, and anything greater than 2.99 is considered the \"safe\" zone."},{"tag":"roic","patterns":"how is roic calculated?","responses":"Return on invested capital (ROIC) is the amount of money a company makes that is above the average cost it pays for its debt and equity capital. It's equal to operating income // total capital"},{"tag":"croic","patterns":"how is croic calculated?","responses":"The percentage return of free cash flow to firm divided by invested capital"},{"tag":"days sale receivable index","patterns":"how is days sale receivable index calculated?","responses":"shows our DSO has changed from one period to the next. A large increase in receivable days might suggest accelerated revenue recognition to inflate profits"},{"tag":"gross margin index","patterns":"how is gross margin index calculated?","responses":"Shows how gross margin has changed from one period to the next.  deteriorating gross margin sends a negative signal about a firm’s prospects and creates an incentive to inflate profits."},{"tag":"fcff","patterns":"how is fcff calculated?","responses":"The free cash flow generated by a company before taking into account interest payments. It shows the total cash generated for both equity and debt investors"},{"tag":"fcfe","patterns":"how is fcfe calculated?","responses":"The free cash flow generated by a company after taking into account interest payments. It shows the total cash generated for just equity investors"},{"tag":"cgo","patterns":"how is cgo calculated?","responses":"Cash generated from operations shows "},{"tag":"sg&a index","patterns":"how is sg&a index calculated?","responses":" Analysts might interpret a disproportionate increase in SG&A relative to sales as a negative signal about a firm’s future prospects, thereby creating an inventive to inflate profits."},{"tag":"depreciation index","patterns":"how is depreciation index calculated?","responses":"a change in depreciation relative to fixed assets today vs the prior period. A falling level of depreciation relative to net fixed assets raises the possibility that a firm has revised upwards the estimated useful life of assets, or adopted a new method that is income increasing."},{"tag":"equity multiplier","patterns":"how is equity multiplier calculated?","responses":"Total assets divided by total shareholders equity. A higher value generally means the company is using more debt to finance its activities, which increases risk."},{"tag":"earnings quality","patterns":"how is earnings quality calculated?","responses":"Calculated as cash flow from operations divided by net income. A ratio higher than 1 indicates high earnings quality, and a ratio less than 1 indicates low-quality"},{"tag":"pvgo","patterns":"how is pvgo calculated?","responses":"Present value of growth opportunities. It represents the amount of a companys stock value that corresponds to expected growth in earnings. It's equal to share price - ( eps // cost of capital)"},{"tag":"oc","patterns":"how is oc calculated?","responses":"Operating cycle is equal to DIO + DSO. It represenrs the number of days it takes a business to receive inventory, sell inventory, and collect cash from the sale, not taking into account the number days the company takes to pay its own suppliers."},{"tag":"pvgo to share price","patterns":"how is pvgo to share price calculated?","responses":"The ratio of present value of growth opportunities relative to the share price."},{"tag":"ev ","patterns":"how is ev  calculated?","responses":"Enterprise value is the total market cap plus net debt. It measures the total value of a company taking into account both equity and debt financing."},{"tag":"retention ratio","patterns":"how is retention ratio calculated?","responses":"The proportion of earnings that are retained and not paid out as dividends relative to total earnings."},{"tag":"p//ocf","patterns":"how is p//ocf calculated?","responses":"The ratio of share price to cash flow from operations per share. A lower multiple indicates a stock may be undervalued. Some analysts prefer this compared to price to earnings since earnings can more easily be manipulated"},{"tag":"p//b","patterns":"how is p//b calculated?","responses":"The ratio of the market price per share to book value of equity per share"},{"tag":"ev//ebit","patterns":"how is ev//ebit calculated?","responses":"The ratio of enterprise value to earnings before interest and taxes.A lower value may indicate the company is undervalued."},{"tag":"ev//ebitda","patterns":"how is ev//ebitda calculated?","responses":"The ratio of enterprise value to earnings before interest, taxes, depreciation, and amortization. A lower value may indicate the company is undervalued."},{"tag":"noncash charges to pp&e","patterns":"how is noncash charges to pp&e calculated?","responses":"The ratio of non cash expenses such as deprecation to the net book value of long-term tangible assets such as property, plant equipment"},{"tag":"effective tax rate","patterns":"how is effective tax rate calculated?","responses":"The rato of tax expense relative to earnings before taxes. It shows proprtion of their earnings that go towards paying taxes."},{"tag":"dso","patterns":"how is dso calculated?","responses":"Days Sales Outstanding (DSO) represents the average number of days it takes credit sales to be converted into cash or how long it takes a company to collect its accounts receivable. It can be calculated by dividing the total accounts receivable during a certain time frame by the total net credit sales. This number is then multiplied by the number of days in the period of time."},{"tag":"dpo","patterns":"how is dpo calculated?","responses":"Days payable outstanding (DPO) is a financial ratio that indicates the average time (in days) that a company takes to pay its bills and invoices to its trade creditors, which may include suppliers, vendors, or financiers. It's calculated by multiplying accounts payable by the number of days in the period and dividing by cost of goods sold."},{"tag":"dio","patterns":"how is dio calculated?","responses":"Days inventory outstanding (DPO)indicates the average number of days a company holds its inventory before selling it It's calculated by multiplying inventory by the number of days in the period and dividing by cost of goods sold."},{"tag":"total capital","patterns":"how is total capital calculated?","responses":"Total capital is defined as total debt plus total shareholders equity. It represents the total book value of financing sources the company has."},{"tag":"liquidity ratios","patterns":"how to interpret liquidity ratios","responses":"Liquidity ratios are financial ratios that measure a company’s ability to repay both short- and long-term obligations. Common ratios are the current ratio, cash ratio, quick ratio, and operating cash flow ratio"},{"tag":"leverage ratios","patterns":"how to interpret leverage ratios","responses":"Leverage measure the amount of capital that comes from debt. In other words, leverage financial ratios are used to evaluate a company’s debt levels. Common leverage ratios include debt to assets, debt to equity, and  interest coverage ratio"},{"tag":"efficiency ratios","patterns":"how to interpret efficiency ratios","responses":"Efficiency ratios, also known as activity financial ratios, are used to measure how well a company is utilizing its assets and resources. Common efficiency ratios include asset turnover, inventory turnover, payables turnover, receivables turnover, DSO, DPO, DIO"},{"tag":"profitability ratios","patterns":"how to interpret profitability ratios","responses":"profitability ratios measure a company’s ability to generate income relative to revenue, balance sheet assets, operating costs, and equity. Common profitability financial ratios include gross margin, operating margin, ROE, & ROA"},{"tag":"market value ratios","patterns":"how to interpret market value ratios","responses":"Market value ratios are used to evaluate the share price of a company’s stock. Common market value ratios include book value per share, dividend yield, P//E, eps, ev//ebit, or ev//ebitda"},{"tag":"current ratio","patterns":"how to interpret current ratio","responses":"current ratio measures a company’s ability to pay off short-term liabilities with current assets. It's equal to current assets // current liabilities"},{"tag":"cash ratio","patterns":"how to interpret cash ratio","responses":"cash ratio measures a company’s ability to pay off short-term liabilities with cash and cash equivalents. It's equal to cash and equivalents // current liabilities"},{"tag":"quick ratio","patterns":"how to interpret quick ratio","responses":"quick ratio measures a company’s ability to pay off short-term liabilities with current assets excluding inventory. It's equal to current assets minus inventory // current liabilities"},{"tag":"operating cash flow ratio","patterns":"how to interpret operating cash flow ratio","responses":"operating cash flow ratio  a measure of the number of times a company can pay off current liabilities with the cash generated in a given period. It's equal to operating cash flow // current liabilities"},{"tag":"debt ratio","patterns":"how to interpret debt ratio","responses":"debt ratio measures the relative amount of a company’s assets that are provided from debt. It's equal to total debt // total assets"},{"tag":"debt to equity ratio","patterns":"how to interpret debt to equity ratio","responses":"debt to equity ratio calculates the weight of total debt and financial liabilities against shareholders’ equity. It's equal to total liabilities // total equity"},{"tag":"interest coverage ratio","patterns":"how to interpret interest coverage ratio","responses":"interest coverage ratio shows how easily a company can pay its interest expense. It's equal to operating income // interest expenses"},{"tag":"asset turnover ratio","patterns":"how to interpret asset turnover ratio","responses":"asset turnover ratio measures a company’s ability to generate sales from assets. It's equal to Net sales // Average total assets"},{"tag":"inventory turnover ratio","patterns":"how to interpret inventory turnover ratio","responses":"inventory turnover ratio measures how many times a company’s inventory is sold and replaced over a given period. It's equal to cost of goods sold // average inventory"},{"tag":"receivable turnover ratio","patterns":"how to interpret receivable turnover ratio","responses":"receivable turnover ratio measures how many times a company can turn receivables into cash over a given period. It's equal to Net credit sales // Average accounts receivable"},{"tag":"credit sales","patterns":"how to interpret credit sales","responses":"Credit sales represent the proportion of net sales that were paid for in credit rather than cash"},{"tag":"gross margin ratio","patterns":"how to interpret gross margin ratio","responses":"gross margin ratio compares the gross profit of a company to its net sales to show how much profit a company makes after paying its cost of goods sold. It's equal to gross profit // net sales"},{"tag":"operating margin","patterns":"how to interpret operating margin","responses":"operating margin compares the operating income of a company to its net sales to determine operating efficiency. It's equal to operating income // net sales"},{"tag":"roa","patterns":"how to interpret roa","responses":"roa measures how efficiently a company is using its assets to generate profit. It's equal to net income // total assets"},{"tag":"roe","patterns":"how to interpret roe","responses":"roe measures how efficiently a company is using its equity to generate profit. It's equal to net income // shareholders equity"},{"tag":"book value per share ","patterns":"how to interpret book value per share ","responses":"book value per share  calculates the per-share value of a company based on the equity available to shareholders. It's equal to (Shareholder’s equity – Preferred equity) // Total common shares outstanding"},{"tag":"dividend yield ratio","patterns":"how to interpret dividend yield ratio","responses":"dividend yield ratio measures the amount of dividends attributed to shareholders relative to the market value per share. It's equal to Dividend per share // Share price"},{"tag":"eps","patterns":"how to interpret eps","responses":"eps measures the amount of net income earned for each share outstanding. It's equal to Net earnings // Total shares outstanding"},{"tag":"price to earnings","patterns":"how to interpret price to earnings","responses":"price to earnings compares a company’s share price to its earnings per share. It's equal to Share price // Earnings per share"},{"tag":"fcf","patterns":"how to interpret fcf","responses":"fcf measures the amount of  cash generated for the company's core business"},{"tag":"ccc","patterns":"how to interpret ccc","responses":"ccc Stands for the cash conversion cycle. Its calculated as DIO + DSO - DPO. It shows the length of time it takes a company to convert its investment into working capital into cash flows from sales"},{"tag":"beniesh m-score","patterns":"how to interpret beniesh m-score","responses":"beniesh m-score  is a mathematical model that uses eight financial ratios weighted by coefficients to identify whether a company has manipulated its profits. If the score is greater than -1.78, earnings manipulation is likely. A score between -2.22 and -1.78 indicates that earnings manipulation is possible, and a score less than -2.22 indicates an unlikely chance of earnings manipulation"},{"tag":"leverage index","patterns":"how to interpret leverage index","responses":"leverage index is measured as total debt relative to total assets. An increase in leverage creates an incentive to manipulate profits in order to meet debt covenants."},{"tag":"ebitda margin","patterns":"how to interpret ebitda margin","responses":"the percentage of ebitda of total revenue"},{"tag":"asset quality index","patterns":"how to interpret asset quality index","responses":"An increase in long term assets (for example, the capitalisation of costs), other than property plant and equipment, relative to total assets indicates that a firm has potentially increased its involvement in cost deferral to inflate profits."},{"tag":"dividend payout ratio","patterns":"how to interpret dividend payout ratio","responses":"the ratio of the total amount of dividends paid out to shareholders relative to the net income of the company."},{"tag":"net working capital","patterns":"how to interpret net working capital","responses":"The difference between the current assets and current laibilities"},{"tag":"change in net working capital","patterns":"how to interpret change in net working capital","responses":"the difference between net working capital in period t and net working capital in period t-1"},{"tag":"altmans z-score","patterns":"how to interpret altmans z-score","responses":"A formula for predicting the liklihood of bankruptcy. Anything less than 1.81 is considered the \"distress zone\", anything between 1.81 and 2.99 is considered a \"grey\" zone, and anything greater than 2.99 is considered the \"safe\" zone."},{"tag":"roic","patterns":"how to interpret roic","responses":"Return on invested capital (ROIC) is the amount of money a company makes that is above the average cost it pays for its debt and equity capital. It's equal to operating income // total capital"},{"tag":"croic","patterns":"how to interpret croic","responses":"The percentage return of free cash flow to firm divided by invested capital"},{"tag":"days sale receivable index","patterns":"how to interpret days sale receivable index","responses":"shows our DSO has changed from one period to the next. A large increase in receivable days might suggest accelerated revenue recognition to inflate profits"},{"tag":"gross margin index","patterns":"how to interpret gross margin index","responses":"Shows how gross margin has changed from one period to the next.  deteriorating gross margin sends a negative signal about a firm’s prospects and creates an incentive to inflate profits."},{"tag":"fcff","patterns":"how to interpret fcff","responses":"The free cash flow generated by a company before taking into account interest payments. It shows the total cash generated for both equity and debt investors"},{"tag":"fcfe","patterns":"how to interpret fcfe","responses":"The free cash flow generated by a company after taking into account interest payments. It shows the total cash generated for just equity investors"},{"tag":"cgo","patterns":"how to interpret cgo","responses":"Cash generated from operations shows "},{"tag":"sg&a index","patterns":"how to interpret sg&a index","responses":" Analysts might interpret a disproportionate increase in SG&A relative to sales as a negative signal about a firm’s future prospects, thereby creating an inventive to inflate profits."},{"tag":"depreciation index","patterns":"how to interpret depreciation index","responses":"a change in depreciation relative to fixed assets today vs the prior period. A falling level of depreciation relative to net fixed assets raises the possibility that a firm has revised upwards the estimated useful life of assets, or adopted a new method that is income increasing."},{"tag":"equity multiplier","patterns":"how to interpret equity multiplier","responses":"Total assets divided by total shareholders equity. A higher value generally means the company is using more debt to finance its activities, which increases risk."},{"tag":"earnings quality","patterns":"how to interpret earnings quality","responses":"Calculated as cash flow from operations divided by net income. A ratio higher than 1 indicates high earnings quality, and a ratio less than 1 indicates low-quality"},{"tag":"pvgo","patterns":"how to interpret pvgo","responses":"Present value of growth opportunities. It represents the amount of a companys stock value that corresponds to expected growth in earnings. It's equal to share price - ( eps // cost of capital)"},{"tag":"oc","patterns":"how to interpret oc","responses":"Operating cycle is equal to DIO + DSO. It represenrs the number of days it takes a business to receive inventory, sell inventory, and collect cash from the sale, not taking into account the number days the company takes to pay its own suppliers."},{"tag":"pvgo to share price","patterns":"how to interpret pvgo to share price","responses":"The ratio of present value of growth opportunities relative to the share price."},{"tag":"ev ","patterns":"how to interpret ev ","responses":"Enterprise value is the total market cap plus net debt. It measures the total value of a company taking into account both equity and debt financing."},{"tag":"retention ratio","patterns":"how to interpret retention ratio","responses":"The proportion of earnings that are retained and not paid out as dividends relative to total earnings."},{"tag":"p//ocf","patterns":"how to interpret p//ocf","responses":"The ratio of share price to cash flow from operations per share. A lower multiple indicates a stock may be undervalued. Some analysts prefer this compared to price to earnings since earnings can more easily be manipulated"},{"tag":"p//b","patterns":"how to interpret p//b","responses":"The ratio of the market price per share to book value of equity per share"},{"tag":"ev//ebit","patterns":"how to interpret ev//ebit","responses":"The ratio of enterprise value to earnings before interest and taxes.A lower value may indicate the company is undervalued."},{"tag":"ev//ebitda","patterns":"how to interpret ev//ebitda","responses":"The ratio of enterprise value to earnings before interest, taxes, depreciation, and amortization. A lower value may indicate the company is undervalued."},{"tag":"noncash charges to pp&e","patterns":"how to interpret noncash charges to pp&e","responses":"The ratio of non cash expenses such as deprecation to the net book value of long-term tangible assets such as property, plant equipment"},{"tag":"effective tax rate","patterns":"how to interpret effective tax rate","responses":"The rato of tax expense relative to earnings before taxes. It shows proprtion of their earnings that go towards paying taxes."},{"tag":"dso","patterns":"how to interpret dso","responses":"Days Sales Outstanding (DSO) represents the average number of days it takes credit sales to be converted into cash or how long it takes a company to collect its accounts receivable. It can be calculated by dividing the total accounts receivable during a certain time frame by the total net credit sales. This number is then multiplied by the number of days in the period of time."},{"tag":"dpo","patterns":"how to interpret dpo","responses":"Days payable outstanding (DPO) is a financial ratio that indicates the average time (in days) that a company takes to pay its bills and invoices to its trade creditors, which may include suppliers, vendors, or financiers. It's calculated by multiplying accounts payable by the number of days in the period and dividing by cost of goods sold."},{"tag":"dio","patterns":"how to interpret dio","responses":"Days inventory outstanding (DPO)indicates the average number of days a company holds its inventory before selling it It's calculated by multiplying inventory by the number of days in the period and dividing by cost of goods sold."},{"tag":"total capital","patterns":"how to interpret total capital","responses":"Total capital is defined as total debt plus total shareholders equity. It represents the total book value of financing sources the company has."},{"tag":"liquidity ratios","patterns":"explain liquidity ratios","responses":"Liquidity ratios are financial ratios that measure a company’s ability to repay both short- and long-term obligations. Common ratios are the current ratio, cash ratio, quick ratio, and operating cash flow ratio"},{"tag":"leverage ratios","patterns":"explain leverage ratios","responses":"Leverage measure the amount of capital that comes from debt. In other words, leverage financial ratios are used to evaluate a company’s debt levels. Common leverage ratios include debt to assets, debt to equity, and  interest coverage ratio"},{"tag":"efficiency ratios","patterns":"explain efficiency ratios","responses":"Efficiency ratios, also known as activity financial ratios, are used to measure how well a company is utilizing its assets and resources. Common efficiency ratios include asset turnover, inventory turnover, payables turnover, receivables turnover, DSO, DPO, DIO"},{"tag":"profitability ratios","patterns":"explain profitability ratios","responses":"profitability ratios measure a company’s ability to generate income relative to revenue, balance sheet assets, operating costs, and equity. Common profitability financial ratios include gross margin, operating margin, ROE, & ROA"},{"tag":"market value ratios","patterns":"explain market value ratios","responses":"Market value ratios are used to evaluate the share price of a company’s stock. Common market value ratios include book value per share, dividend yield, P//E, eps, ev//ebit, or ev//ebitda"},{"tag":"current ratio","patterns":"explain current ratio","responses":"current ratio measures a company’s ability to pay off short-term liabilities with current assets. It's equal to current assets // current liabilities"},{"tag":"cash ratio","patterns":"explain cash ratio","responses":"cash ratio measures a company’s ability to pay off short-term liabilities with cash and cash equivalents. It's equal to cash and equivalents // current liabilities"},{"tag":"quick ratio","patterns":"explain quick ratio","responses":"quick ratio measures a company’s ability to pay off short-term liabilities with current assets excluding inventory. It's equal to current assets minus inventory // current liabilities"},{"tag":"operating cash flow ratio","patterns":"explain operating cash flow ratio","responses":"operating cash flow ratio  a measure of the number of times a company can pay off current liabilities with the cash generated in a given period. It's equal to operating cash flow // current liabilities"},{"tag":"debt ratio","patterns":"explain debt ratio","responses":"debt ratio measures the relative amount of a company’s assets that are provided from debt. It's equal to total debt // total assets"},{"tag":"debt to equity ratio","patterns":"explain debt to equity ratio","responses":"debt to equity ratio calculates the weight of total debt and financial liabilities against shareholders’ equity. It's equal to total liabilities // total equity"},{"tag":"interest coverage ratio","patterns":"explain interest coverage ratio","responses":"interest coverage ratio shows how easily a company can pay its interest expense. It's equal to operating income // interest expenses"},{"tag":"asset turnover ratio","patterns":"explain asset turnover ratio","responses":"asset turnover ratio measures a company’s ability to generate sales from assets. It's equal to Net sales // Average total assets"},{"tag":"inventory turnover ratio","patterns":"explain inventory turnover ratio","responses":"inventory turnover ratio measures how many times a company’s inventory is sold and replaced over a given period. It's equal to cost of goods sold // average inventory"},{"tag":"receivable turnover ratio","patterns":"explain receivable turnover ratio","responses":"receivable turnover ratio measures how many times a company can turn receivables into cash over a given period. It's equal to Net credit sales // Average accounts receivable"},{"tag":"credit sales","patterns":"explain credit sales","responses":"Credit sales represent the proportion of net sales that were paid for in credit rather than cash"},{"tag":"gross margin ratio","patterns":"explain gross margin ratio","responses":"gross margin ratio compares the gross profit of a company to its net sales to show how much profit a company makes after paying its cost of goods sold. It's equal to gross profit // net sales"},{"tag":"operating margin","patterns":"explain operating margin","responses":"operating margin compares the operating income of a company to its net sales to determine operating efficiency. It's equal to operating income // net sales"},{"tag":"roa","patterns":"explain roa","responses":"roa measures how efficiently a company is using its assets to generate profit. It's equal to net income // total assets"},{"tag":"roe","patterns":"explain roe","responses":"roe measures how efficiently a company is using its equity to generate profit. It's equal to net income // shareholders equity"},{"tag":"book value per share ","patterns":"explain book value per share ","responses":"book value per share  calculates the per-share value of a company based on the equity available to shareholders. It's equal to (Shareholder’s equity – Preferred equity) // Total common shares outstanding"},{"tag":"dividend yield ratio","patterns":"explain dividend yield ratio","responses":"dividend yield ratio measures the amount of dividends attributed to shareholders relative to the market value per share. It's equal to Dividend per share // Share price"},{"tag":"eps","patterns":"explain eps","responses":"eps measures the amount of net income earned for each share outstanding. It's equal to Net earnings // Total shares outstanding"},{"tag":"price to earnings","patterns":"explain price to earnings","responses":"price to earnings compares a company’s share price to its earnings per share. It's equal to Share price // Earnings per share"},{"tag":"fcf","patterns":"explain fcf","responses":"fcf measures the amount of  cash generated for the company's core business"},{"tag":"ccc","patterns":"explain ccc","responses":"ccc Stands for the cash conversion cycle. Its calculated as DIO + DSO - DPO. It shows the length of time it takes a company to convert its investment into working capital into cash flows from sales"},{"tag":"beniesh m-score","patterns":"explain beniesh m-score","responses":"beniesh m-score  is a mathematical model that uses eight financial ratios weighted by coefficients to identify whether a company has manipulated its profits. If the score is greater than -1.78, earnings manipulation is likely. A score between -2.22 and -1.78 indicates that earnings manipulation is possible, and a score less than -2.22 indicates an unlikely chance of earnings manipulation"},{"tag":"leverage index","patterns":"explain leverage index","responses":"leverage index is measured as total debt relative to total assets. An increase in leverage creates an incentive to manipulate profits in order to meet debt covenants."},{"tag":"ebitda margin","patterns":"explain ebitda margin","responses":"the percentage of ebitda of total revenue"},{"tag":"asset quality index","patterns":"explain asset quality index","responses":"An increase in long term assets (for example, the capitalisation of costs), other than property plant and equipment, relative to total assets indicates that a firm has potentially increased its involvement in cost deferral to inflate profits."},{"tag":"dividend payout ratio","patterns":"explain dividend payout ratio","responses":"the ratio of the total amount of dividends paid out to shareholders relative to the net income of the company."},{"tag":"net working capital","patterns":"explain net working capital","responses":"The difference between the current assets and current laibilities"},{"tag":"change in net working capital","patterns":"explain change in net working capital","responses":"the difference between net working capital in period t and net working capital in period t-1"},{"tag":"altmans z-score","patterns":"explain altmans z-score","responses":"A formula for predicting the liklihood of bankruptcy. Anything less than 1.81 is considered the \"distress zone\", anything between 1.81 and 2.99 is considered a \"grey\" zone, and anything greater than 2.99 is considered the \"safe\" zone."},{"tag":"roic","patterns":"explain roic","responses":"Return on invested capital (ROIC) is the amount of money a company makes that is above the average cost it pays for its debt and equity capital. It's equal to operating income // total capital"},{"tag":"croic","patterns":"explain croic","responses":"The percentage return of free cash flow to firm divided by invested capital"},{"tag":"days sale receivable index","patterns":"explain days sale receivable index","responses":"shows our DSO has changed from one period to the next. A large increase in receivable days might suggest accelerated revenue recognition to inflate profits"},{"tag":"gross margin index","patterns":"explain gross margin index","responses":"Shows how gross margin has changed from one period to the next.  deteriorating gross margin sends a negative signal about a firm’s prospects and creates an incentive to inflate profits."},{"tag":"fcff","patterns":"explain fcff","responses":"The free cash flow generated by a company before taking into account interest payments. It shows the total cash generated for both equity and debt investors"},{"tag":"fcfe","patterns":"explain fcfe","responses":"The free cash flow generated by a company after taking into account interest payments. It shows the total cash generated for just equity investors"},{"tag":"cgo","patterns":"explain cgo","responses":"Cash generated from operations shows "},{"tag":"sg&a index","patterns":"explain sg&a index","responses":" Analysts might interpret a disproportionate increase in SG&A relative to sales as a negative signal about a firm’s future prospects, thereby creating an inventive to inflate profits."},{"tag":"depreciation index","patterns":"explain depreciation index","responses":"a change in depreciation relative to fixed assets today vs the prior period. A falling level of depreciation relative to net fixed assets raises the possibility that a firm has revised upwards the estimated useful life of assets, or adopted a new method that is income increasing."},{"tag":"equity multiplier","patterns":"explain equity multiplier","responses":"Total assets divided by total shareholders equity. A higher value generally means the company is using more debt to finance its activities, which increases risk."},{"tag":"earnings quality","patterns":"explain earnings quality","responses":"Calculated as cash flow from operations divided by net income. A ratio higher than 1 indicates high earnings quality, and a ratio less than 1 indicates low-quality"},{"tag":"pvgo","patterns":"explain pvgo","responses":"Present value of growth opportunities. It represents the amount of a companys stock value that corresponds to expected growth in earnings. It's equal to share price - ( eps // cost of capital)"},{"tag":"oc","patterns":"explain oc","responses":"Operating cycle is equal to DIO + DSO. It represenrs the number of days it takes a business to receive inventory, sell inventory, and collect cash from the sale, not taking into account the number days the company takes to pay its own suppliers."},{"tag":"pvgo to share price","patterns":"explain pvgo to share price","responses":"The ratio of present value of growth opportunities relative to the share price."},{"tag":"ev ","patterns":"explain ev ","responses":"Enterprise value is the total market cap plus net debt. It measures the total value of a company taking into account both equity and debt financing."},{"tag":"retention ratio","patterns":"explain retention ratio","responses":"The proportion of earnings that are retained and not paid out as dividends relative to total earnings."},{"tag":"p//ocf","patterns":"explain p//ocf","responses":"The ratio of share price to cash flow from operations per share. A lower multiple indicates a stock may be undervalued. Some analysts prefer this compared to price to earnings since earnings can more easily be manipulated"},{"tag":"p//b","patterns":"explain p//b","responses":"The ratio of the market price per share to book value of equity per share"},{"tag":"ev//ebit","patterns":"explain ev//ebit","responses":"The ratio of enterprise value to earnings before interest and taxes.A lower value may indicate the company is undervalued."},{"tag":"ev//ebitda","patterns":"explain ev//ebitda","responses":"The ratio of enterprise value to earnings before interest, taxes, depreciation, and amortization. A lower value may indicate the company is undervalued."},{"tag":"noncash charges to pp&e","patterns":"explain noncash charges to pp&e","responses":"The ratio of non cash expenses such as deprecation to the net book value of long-term tangible assets such as property, plant equipment"},{"tag":"effective tax rate","patterns":"explain effective tax rate","responses":"The rato of tax expense relative to earnings before taxes. It shows proprtion of their earnings that go towards paying taxes."},{"tag":"dso","patterns":"explain dso","responses":"Days Sales Outstanding (DSO) represents the average number of days it takes credit sales to be converted into cash or how long it takes a company to collect its accounts receivable. It can be calculated by dividing the total accounts receivable during a certain time frame by the total net credit sales. This number is then multiplied by the number of days in the period of time."},{"tag":"dpo","patterns":"explain dpo","responses":"Days payable outstanding (DPO) is a financial ratio that indicates the average time (in days) that a company takes to pay its bills and invoices to its trade creditors, which may include suppliers, vendors, or financiers. It's calculated by multiplying accounts payable by the number of days in the period and dividing by cost of goods sold."},{"tag":"dio","patterns":"explain dio","responses":"Days inventory outstanding (DPO)indicates the average number of days a company holds its inventory before selling it It's calculated by multiplying inventory by the number of days in the period and dividing by cost of goods sold."},{"tag":"total capital","patterns":"explain total capital","responses":"Total capital is defined as total debt plus total shareholders equity. It represents the total book value of financing sources the company has."},{"tag":"liquidity ratios","patterns":"please explain liquidity ratios","responses":"Liquidity ratios are financial ratios that measure a company’s ability to repay both short- and long-term obligations. Common ratios are the current ratio, cash ratio, quick ratio, and operating cash flow ratio"},{"tag":"leverage ratios","patterns":"please explain leverage ratios","responses":"Leverage measure the amount of capital that comes from debt. In other words, leverage financial ratios are used to evaluate a company’s debt levels. Common leverage ratios include debt to assets, debt to equity, and  interest coverage ratio"},{"tag":"efficiency ratios","patterns":"please explain efficiency ratios","responses":"Efficiency ratios, also known as activity financial ratios, are used to measure how well a company is utilizing its assets and resources. Common efficiency ratios include asset turnover, inventory turnover, payables turnover, receivables turnover, DSO, DPO, DIO"},{"tag":"profitability ratios","patterns":"please explain profitability ratios","responses":"profitability ratios measure a company’s ability to generate income relative to revenue, balance sheet assets, operating costs, and equity. Common profitability financial ratios include gross margin, operating margin, ROE, & ROA"},{"tag":"market value ratios","patterns":"please explain market value ratios","responses":"Market value ratios are used to evaluate the share price of a company’s stock. Common market value ratios include book value per share, dividend yield, P//E, eps, ev//ebit, or ev//ebitda"},{"tag":"current ratio","patterns":"please explain current ratio","responses":"current ratio measures a company’s ability to pay off short-term liabilities with current assets. It's equal to current assets // current liabilities"},{"tag":"cash ratio","patterns":"please explain cash ratio","responses":"cash ratio measures a company’s ability to pay off short-term liabilities with cash and cash equivalents. It's equal to cash and equivalents // current liabilities"},{"tag":"quick ratio","patterns":"please explain quick ratio","responses":"quick ratio measures a company’s ability to pay off short-term liabilities with current assets excluding inventory. It's equal to current assets minus inventory // current liabilities"},{"tag":"operating cash flow ratio","patterns":"please explain operating cash flow ratio","responses":"operating cash flow ratio  a measure of the number of times a company can pay off current liabilities with the cash generated in a given period. It's equal to operating cash flow // current liabilities"},{"tag":"debt ratio","patterns":"please explain debt ratio","responses":"debt ratio measures the relative amount of a company’s assets that are provided from debt. It's equal to total debt // total assets"},{"tag":"debt to equity ratio","patterns":"please explain debt to equity ratio","responses":"debt to equity ratio calculates the weight of total debt and financial liabilities against shareholders’ equity. It's equal to total liabilities // total equity"},{"tag":"interest coverage ratio","patterns":"please explain interest coverage ratio","responses":"interest coverage ratio shows how easily a company can pay its interest expense. It's equal to operating income // interest expenses"},{"tag":"asset turnover ratio","patterns":"please explain asset turnover ratio","responses":"asset turnover ratio measures a company’s ability to generate sales from assets. It's equal to Net sales // Average total assets"},{"tag":"inventory turnover ratio","patterns":"please explain inventory turnover ratio","responses":"inventory turnover ratio measures how many times a company’s inventory is sold and replaced over a given period. It's equal to cost of goods sold // average inventory"},{"tag":"receivable turnover ratio","patterns":"please explain receivable turnover ratio","responses":"receivable turnover ratio measures how many times a company can turn receivables into cash over a given period. It's equal to Net credit sales // Average accounts receivable"},{"tag":"credit sales","patterns":"please explain credit sales","responses":"Credit sales represent the proportion of net sales that were paid for in credit rather than cash"},{"tag":"gross margin ratio","patterns":"please explain gross margin ratio","responses":"gross margin ratio compares the gross profit of a company to its net sales to show how much profit a company makes after paying its cost of goods sold. It's equal to gross profit // net sales"},{"tag":"operating margin","patterns":"please explain operating margin","responses":"operating margin compares the operating income of a company to its net sales to determine operating efficiency. It's equal to operating income // net sales"},{"tag":"roa","patterns":"please explain roa","responses":"roa measures how efficiently a company is using its assets to generate profit. It's equal to net income // total assets"},{"tag":"roe","patterns":"please explain roe","responses":"roe measures how efficiently a company is using its equity to generate profit. It's equal to net income // shareholders equity"},{"tag":"book value per share ","patterns":"please explain book value per share ","responses":"book value per share  calculates the per-share value of a company based on the equity available to shareholders. It's equal to (Shareholder’s equity – Preferred equity) // Total common shares outstanding"},{"tag":"dividend yield ratio","patterns":"please explain dividend yield ratio","responses":"dividend yield ratio measures the amount of dividends attributed to shareholders relative to the market value per share. It's equal to Dividend per share // Share price"},{"tag":"eps","patterns":"please explain eps","responses":"eps measures the amount of net income earned for each share outstanding. It's equal to Net earnings // Total shares outstanding"},{"tag":"price to earnings","patterns":"please explain price to earnings","responses":"price to earnings compares a company’s share price to its earnings per share. It's equal to Share price // Earnings per share"},{"tag":"fcf","patterns":"please explain fcf","responses":"fcf measures the amount of  cash generated for the company's core business"},{"tag":"ccc","patterns":"please explain ccc","responses":"ccc Stands for the cash conversion cycle. Its calculated as DIO + DSO - DPO. It shows the length of time it takes a company to convert its investment into working capital into cash flows from sales"},{"tag":"beniesh m-score","patterns":"please explain beniesh m-score","responses":"beniesh m-score  is a mathematical model that uses eight financial ratios weighted by coefficients to identify whether a company has manipulated its profits. If the score is greater than -1.78, earnings manipulation is likely. A score between -2.22 and -1.78 indicates that earnings manipulation is possible, and a score less than -2.22 indicates an unlikely chance of earnings manipulation"},{"tag":"leverage index","patterns":"please explain leverage index","responses":"leverage index is measured as total debt relative to total assets. An increase in leverage creates an incentive to manipulate profits in order to meet debt covenants."},{"tag":"ebitda margin","patterns":"please explain ebitda margin","responses":"the percentage of ebitda of total revenue"},{"tag":"asset quality index","patterns":"please explain asset quality index","responses":"An increase in long term assets (for example, the capitalisation of costs), other than property plant and equipment, relative to total assets indicates that a firm has potentially increased its involvement in cost deferral to inflate profits."},{"tag":"dividend payout ratio","patterns":"please explain dividend payout ratio","responses":"the ratio of the total amount of dividends paid out to shareholders relative to the net income of the company."},{"tag":"net working capital","patterns":"please explain net working capital","responses":"The difference between the current assets and current laibilities"},{"tag":"change in net working capital","patterns":"please explain change in net working capital","responses":"the difference between net working capital in period t and net working capital in period t-1"},{"tag":"altmans z-score","patterns":"please explain altmans z-score","responses":"A formula for predicting the liklihood of bankruptcy. Anything less than 1.81 is considered the \"distress zone\", anything between 1.81 and 2.99 is considered a \"grey\" zone, and anything greater than 2.99 is considered the \"safe\" zone."},{"tag":"roic","patterns":"please explain roic","responses":"Return on invested capital (ROIC) is the amount of money a company makes that is above the average cost it pays for its debt and equity capital. It's equal to operating income // total capital"},{"tag":"croic","patterns":"please explain croic","responses":"The percentage return of free cash flow to firm divided by invested capital"},{"tag":"days sale receivable index","patterns":"please explain days sale receivable index","responses":"shows our DSO has changed from one period to the next. A large increase in receivable days might suggest accelerated revenue recognition to inflate profits"},{"tag":"gross margin index","patterns":"please explain gross margin index","responses":"Shows how gross margin has changed from one period to the next.  deteriorating gross margin sends a negative signal about a firm’s prospects and creates an incentive to inflate profits."},{"tag":"fcff","patterns":"please explain fcff","responses":"The free cash flow generated by a company before taking into account interest payments. It shows the total cash generated for both equity and debt investors"},{"tag":"fcfe","patterns":"please explain fcfe","responses":"The free cash flow generated by a company after taking into account interest payments. It shows the total cash generated for just equity investors"},{"tag":"cgo","patterns":"please explain cgo","responses":"Cash generated from operations shows "},{"tag":"sg&a index","patterns":"please explain sg&a index","responses":" Analysts might interpret a disproportionate increase in SG&A relative to sales as a negative signal about a firm’s future prospects, thereby creating an inventive to inflate profits."},{"tag":"depreciation index","patterns":"please explain depreciation index","responses":"a change in depreciation relative to fixed assets today vs the prior period. A falling level of depreciation relative to net fixed assets raises the possibility that a firm has revised upwards the estimated useful life of assets, or adopted a new method that is income increasing."},{"tag":"equity multiplier","patterns":"please explain equity multiplier","responses":"Total assets divided by total shareholders equity. A higher value generally means the company is using more debt to finance its activities, which increases risk."},{"tag":"earnings quality","patterns":"please explain earnings quality","responses":"Calculated as cash flow from operations divided by net income. A ratio higher than 1 indicates high earnings quality, and a ratio less than 1 indicates low-quality"},{"tag":"pvgo","patterns":"please explain pvgo","responses":"Present value of growth opportunities. It represents the amount of a companys stock value that corresponds to expected growth in earnings. It's equal to share price - ( eps // cost of capital)"},{"tag":"oc","patterns":"please explain oc","responses":"Operating cycle is equal to DIO + DSO. It represenrs the number of days it takes a business to receive inventory, sell inventory, and collect cash from the sale, not taking into account the number days the company takes to pay its own suppliers."},{"tag":"pvgo to share price","patterns":"please explain pvgo to share price","responses":"The ratio of present value of growth opportunities relative to the share price."},{"tag":"ev ","patterns":"please explain ev ","responses":"Enterprise value is the total market cap plus net debt. It measures the total value of a company taking into account both equity and debt financing."},{"tag":"retention ratio","patterns":"please explain retention ratio","responses":"The proportion of earnings that are retained and not paid out as dividends relative to total earnings."},{"tag":"p//ocf","patterns":"please explain p//ocf","responses":"The ratio of share price to cash flow from operations per share. A lower multiple indicates a stock may be undervalued. Some analysts prefer this compared to price to earnings since earnings can more easily be manipulated"},{"tag":"p//b","patterns":"please explain p//b","responses":"The ratio of the market price per share to book value of equity per share"},{"tag":"ev//ebit","patterns":"please explain ev//ebit","responses":"The ratio of enterprise value to earnings before interest and taxes.A lower value may indicate the company is undervalued."},{"tag":"ev//ebitda","patterns":"please explain ev//ebitda","responses":"The ratio of enterprise value to earnings before interest, taxes, depreciation, and amortization. A lower value may indicate the company is undervalued."},{"tag":"noncash charges to pp&e","patterns":"please explain noncash charges to pp&e","responses":"The ratio of non cash expenses such as deprecation to the net book value of long-term tangible assets such as property, plant equipment"},{"tag":"effective tax rate","patterns":"please explain effective tax rate","responses":"The rato of tax expense relative to earnings before taxes. It shows proprtion of their earnings that go towards paying taxes."},{"tag":"dso","patterns":"please explain dso","responses":"Days Sales Outstanding (DSO) represents the average number of days it takes credit sales to be converted into cash or how long it takes a company to collect its accounts receivable. It can be calculated by dividing the total accounts receivable during a certain time frame by the total net credit sales. This number is then multiplied by the number of days in the period of time."},{"tag":"dpo","patterns":"please explain dpo","responses":"Days payable outstanding (DPO) is a financial ratio that indicates the average time (in days) that a company takes to pay its bills and invoices to its trade creditors, which may include suppliers, vendors, or financiers. It's calculated by multiplying accounts payable by the number of days in the period and dividing by cost of goods sold."},{"tag":"dio","patterns":"please explain dio","responses":"Days inventory outstanding (DPO)indicates the average number of days a company holds its inventory before selling it It's calculated by multiplying inventory by the number of days in the period and dividing by cost of goods sold."},{"tag":"total capital","patterns":"please explain total capital","responses":"Total capital is defined as total debt plus total shareholders equity. It represents the total book value of financing sources the company has."},{"tag":"liquidity ratios","patterns":"can you tell me what liquidity ratios is?","responses":"Liquidity ratios are financial ratios that measure a company’s ability to repay both short- and long-term obligations. Common ratios are the current ratio, cash ratio, quick ratio, and operating cash flow ratio"},{"tag":"leverage ratios","patterns":"can you tell me what leverage ratios is?","responses":"Leverage measure the amount of capital that comes from debt. In other words, leverage financial ratios are used to evaluate a company’s debt levels. Common leverage ratios include debt to assets, debt to equity, and  interest coverage ratio"},{"tag":"efficiency ratios","patterns":"can you tell me what efficiency ratios is?","responses":"Efficiency ratios, also known as activity financial ratios, are used to measure how well a company is utilizing its assets and resources. Common efficiency ratios include asset turnover, inventory turnover, payables turnover, receivables turnover, DSO, DPO, DIO"},{"tag":"profitability ratios","patterns":"can you tell me what profitability ratios is?","responses":"profitability ratios measure a company’s ability to generate income relative to revenue, balance sheet assets, operating costs, and equity. Common profitability financial ratios include gross margin, operating margin, ROE, & ROA"},{"tag":"market value ratios","patterns":"can you tell me what market value ratios is?","responses":"Market value ratios are used to evaluate the share price of a company’s stock. Common market value ratios include book value per share, dividend yield, P//E, eps, ev//ebit, or ev//ebitda"},{"tag":"current ratio","patterns":"can you tell me what current ratio is?","responses":"current ratio measures a company’s ability to pay off short-term liabilities with current assets. It's equal to current assets // current liabilities"},{"tag":"cash ratio","patterns":"can you tell me what cash ratio is?","responses":"cash ratio measures a company’s ability to pay off short-term liabilities with cash and cash equivalents. It's equal to cash and equivalents // current liabilities"},{"tag":"quick ratio","patterns":"can you tell me what quick ratio is?","responses":"quick ratio measures a company’s ability to pay off short-term liabilities with current assets excluding inventory. It's equal to current assets minus inventory // current liabilities"},{"tag":"operating cash flow ratio","patterns":"can you tell me what operating cash flow ratio is?","responses":"operating cash flow ratio  a measure of the number of times a company can pay off current liabilities with the cash generated in a given period. It's equal to operating cash flow // current liabilities"},{"tag":"debt ratio","patterns":"can you tell me what debt ratio is?","responses":"debt ratio measures the relative amount of a company’s assets that are provided from debt. It's equal to total debt // total assets"},{"tag":"debt to equity ratio","patterns":"can you tell me what debt to equity ratio is?","responses":"debt to equity ratio calculates the weight of total debt and financial liabilities against shareholders’ equity. It's equal to total liabilities // total equity"},{"tag":"interest coverage ratio","patterns":"can you tell me what interest coverage ratio is?","responses":"interest coverage ratio shows how easily a company can pay its interest expense. It's equal to operating income // interest expenses"},{"tag":"asset turnover ratio","patterns":"can you tell me what asset turnover ratio is?","responses":"asset turnover ratio measures a company’s ability to generate sales from assets. It's equal to Net sales // Average total assets"},{"tag":"inventory turnover ratio","patterns":"can you tell me what inventory turnover ratio is?","responses":"inventory turnover ratio measures how many times a company’s inventory is sold and replaced over a given period. It's equal to cost of goods sold // average inventory"},{"tag":"receivable turnover ratio","patterns":"can you tell me what receivable turnover ratio is?","responses":"receivable turnover ratio measures how many times a company can turn receivables into cash over a given period. It's equal to Net credit sales // Average accounts receivable"},{"tag":"credit sales","patterns":"can you tell me what credit sales is?","responses":"Credit sales represent the proportion of net sales that were paid for in credit rather than cash"},{"tag":"gross margin ratio","patterns":"can you tell me what gross margin ratio is?","responses":"gross margin ratio compares the gross profit of a company to its net sales to show how much profit a company makes after paying its cost of goods sold. It's equal to gross profit // net sales"},{"tag":"operating margin","patterns":"can you tell me what operating margin is?","responses":"operating margin compares the operating income of a company to its net sales to determine operating efficiency. It's equal to operating income // net sales"},{"tag":"roa","patterns":"can you tell me what roa is?","responses":"roa measures how efficiently a company is using its assets to generate profit. It's equal to net income // total assets"},{"tag":"roe","patterns":"can you tell me what roe is?","responses":"roe measures how efficiently a company is using its equity to generate profit. It's equal to net income // shareholders equity"},{"tag":"book value per share ","patterns":"can you tell me what book value per share  is?","responses":"book value per share  calculates the per-share value of a company based on the equity available to shareholders. It's equal to (Shareholder’s equity – Preferred equity) // Total common shares outstanding"},{"tag":"dividend yield ratio","patterns":"can you tell me what dividend yield ratio is?","responses":"dividend yield ratio measures the amount of dividends attributed to shareholders relative to the market value per share. It's equal to Dividend per share // Share price"},{"tag":"eps","patterns":"can you tell me what eps is?","responses":"eps measures the amount of net income earned for each share outstanding. It's equal to Net earnings // Total shares outstanding"},{"tag":"price to earnings","patterns":"can you tell me what price to earnings is?","responses":"price to earnings compares a company’s share price to its earnings per share. It's equal to Share price // Earnings per share"},{"tag":"fcf","patterns":"can you tell me what fcf is?","responses":"fcf measures the amount of  cash generated for the company's core business"},{"tag":"ccc","patterns":"can you tell me what ccc is?","responses":"ccc Stands for the cash conversion cycle. Its calculated as DIO + DSO - DPO. It shows the length of time it takes a company to convert its investment into working capital into cash flows from sales"},{"tag":"beniesh m-score","patterns":"can you tell me what beniesh m-score is?","responses":"beniesh m-score  is a mathematical model that uses eight financial ratios weighted by coefficients to identify whether a company has manipulated its profits. If the score is greater than -1.78, earnings manipulation is likely. A score between -2.22 and -1.78 indicates that earnings manipulation is possible, and a score less than -2.22 indicates an unlikely chance of earnings manipulation"},{"tag":"leverage index","patterns":"can you tell me what leverage index is?","responses":"leverage index is measured as total debt relative to total assets. An increase in leverage creates an incentive to manipulate profits in order to meet debt covenants."},{"tag":"ebitda margin","patterns":"can you tell me what ebitda margin is?","responses":"the percentage of ebitda of total revenue"},{"tag":"asset quality index","patterns":"can you tell me what asset quality index is?","responses":"An increase in long term assets (for example, the capitalisation of costs), other than property plant and equipment, relative to total assets indicates that a firm has potentially increased its involvement in cost deferral to inflate profits."},{"tag":"dividend payout ratio","patterns":"can you tell me what dividend payout ratio is?","responses":"the ratio of the total amount of dividends paid out to shareholders relative to the net income of the company."},{"tag":"net working capital","patterns":"can you tell me what net working capital is?","responses":"The difference between the current assets and current laibilities"},{"tag":"change in net working capital","patterns":"can you tell me what change in net working capital is?","responses":"the difference between net working capital in period t and net working capital in period t-1"},{"tag":"altmans z-score","patterns":"can you tell me what altmans z-score is?","responses":"A formula for predicting the liklihood of bankruptcy. Anything less than 1.81 is considered the \"distress zone\", anything between 1.81 and 2.99 is considered a \"grey\" zone, and anything greater than 2.99 is considered the \"safe\" zone."},{"tag":"roic","patterns":"can you tell me what roic is?","responses":"Return on invested capital (ROIC) is the amount of money a company makes that is above the average cost it pays for its debt and equity capital. It's equal to operating income // total capital"},{"tag":"croic","patterns":"can you tell me what croic is?","responses":"The percentage return of free cash flow to firm divided by invested capital"},{"tag":"days sale receivable index","patterns":"can you tell me what days sale receivable index is?","responses":"shows our DSO has changed from one period to the next. A large increase in receivable days might suggest accelerated revenue recognition to inflate profits"},{"tag":"gross margin index","patterns":"can you tell me what gross margin index is?","responses":"Shows how gross margin has changed from one period to the next.  deteriorating gross margin sends a negative signal about a firm’s prospects and creates an incentive to inflate profits."},{"tag":"fcff","patterns":"can you tell me what fcff is?","responses":"The free cash flow generated by a company before taking into account interest payments. It shows the total cash generated for both equity and debt investors"},{"tag":"fcfe","patterns":"can you tell me what fcfe is?","responses":"The free cash flow generated by a company after taking into account interest payments. It shows the total cash generated for just equity investors"},{"tag":"cgo","patterns":"can you tell me what cgo is?","responses":"Cash generated from operations shows "},{"tag":"sg&a index","patterns":"can you tell me what sg&a index is?","responses":" Analysts might interpret a disproportionate increase in SG&A relative to sales as a negative signal about a firm’s future prospects, thereby creating an inventive to inflate profits."},{"tag":"depreciation index","patterns":"can you tell me what depreciation index is?","responses":"a change in depreciation relative to fixed assets today vs the prior period. A falling level of depreciation relative to net fixed assets raises the possibility that a firm has revised upwards the estimated useful life of assets, or adopted a new method that is income increasing."},{"tag":"equity multiplier","patterns":"can you tell me what equity multiplier is?","responses":"Total assets divided by total shareholders equity. A higher value generally means the company is using more debt to finance its activities, which increases risk."},{"tag":"earnings quality","patterns":"can you tell me what earnings quality is?","responses":"Calculated as cash flow from operations divided by net income. A ratio higher than 1 indicates high earnings quality, and a ratio less than 1 indicates low-quality"},{"tag":"pvgo","patterns":"can you tell me what pvgo is?","responses":"Present value of growth opportunities. It represents the amount of a companys stock value that corresponds to expected growth in earnings. It's equal to share price - ( eps // cost of capital)"},{"tag":"oc","patterns":"can you tell me what oc is?","responses":"Operating cycle is equal to DIO + DSO. It represenrs the number of days it takes a business to receive inventory, sell inventory, and collect cash from the sale, not taking into account the number days the company takes to pay its own suppliers."},{"tag":"pvgo to share price","patterns":"can you tell me what pvgo to share price is?","responses":"The ratio of present value of growth opportunities relative to the share price."},{"tag":"ev ","patterns":"can you tell me what ev  is?","responses":"Enterprise value is the total market cap plus net debt. It measures the total value of a company taking into account both equity and debt financing."},{"tag":"retention ratio","patterns":"can you tell me what retention ratio is?","responses":"The proportion of earnings that are retained and not paid out as dividends relative to total earnings."},{"tag":"p//ocf","patterns":"can you tell me what p//ocf is?","responses":"The ratio of share price to cash flow from operations per share. A lower multiple indicates a stock may be undervalued. Some analysts prefer this compared to price to earnings since earnings can more easily be manipulated"},{"tag":"p//b","patterns":"can you tell me what p//b is?","responses":"The ratio of the market price per share to book value of equity per share"},{"tag":"ev//ebit","patterns":"can you tell me what ev//ebit is?","responses":"The ratio of enterprise value to earnings before interest and taxes.A lower value may indicate the company is undervalued."},{"tag":"ev//ebitda","patterns":"can you tell me what ev//ebitda is?","responses":"The ratio of enterprise value to earnings before interest, taxes, depreciation, and amortization. A lower value may indicate the company is undervalued."},{"tag":"noncash charges to pp&e","patterns":"can you tell me what noncash charges to pp&e is?","responses":"The ratio of non cash expenses such as deprecation to the net book value of long-term tangible assets such as property, plant equipment"},{"tag":"effective tax rate","patterns":"can you tell me what effective tax rate is?","responses":"The rato of tax expense relative to earnings before taxes. It shows proprtion of their earnings that go towards paying taxes."},{"tag":"dso","patterns":"can you tell me what dso is?","responses":"Days Sales Outstanding (DSO) represents the average number of days it takes credit sales to be converted into cash or how long it takes a company to collect its accounts receivable. It can be calculated by dividing the total accounts receivable during a certain time frame by the total net credit sales. This number is then multiplied by the number of days in the period of time."},{"tag":"dpo","patterns":"can you tell me what dpo is?","responses":"Days payable outstanding (DPO) is a financial ratio that indicates the average time (in days) that a company takes to pay its bills and invoices to its trade creditors, which may include suppliers, vendors, or financiers. It's calculated by multiplying accounts payable by the number of days in the period and dividing by cost of goods sold."},{"tag":"dio","patterns":"can you tell me what dio is?","responses":"Days inventory outstanding (DPO)indicates the average number of days a company holds its inventory before selling it It's calculated by multiplying inventory by the number of days in the period and dividing by cost of goods sold."},{"tag":"total capital","patterns":"can you tell me what total capital is?","responses":"Total capital is defined as total debt plus total shareholders equity. It represents the total book value of financing sources the company has."},{"tag":"sentiment analysis","patterns":"what is sentiment analysis?","responses":"Sentiment analysis is a process of analyzing textual data whether it is generally positive, negative, or neutral. It is used to determine invesotrs overall opinion of a company based on tweets, threads, and comments. "},{"tag":"debt","patterns":"is debt bad?","responses":"Too much debt can be bad, since it increases the risk of a company defaulting. Some debt can be good, since it is cheaper than equities and can be used to offset their tax expense."},{"tag":"best stocks","patterns":"what are the best stocks? ","responses":"I am unable to recommend specific investments. Instead, I'm simply a source for any general questions you may have about the data available"},{"tag":"dcf","patterns":"what is a dcf?","responses":"A discounted cash flow analysis is a fundamental valuation technique. It's basic premise is a company should be worth how much cash it brings in. Our dcf model attempts to forecast all future cash flow a company is expected to generate for the next 5 years, as well as the terminal value of that last cash flow (the value of that cash flow assuming it grows at a constant rate in perpetuity), are discounted back to the present value based on the company's cost of capital. This gives us the entprise value, which is used to calculate share price by subtracting net debt and then dividing by the basic number of shares outstanding. "},{"tag":"comps","patterns":"what is comparisons analysis?","responses":"Comparable company analysis is the process of comparing companies based on similar metrics to determine their enterprise value. A company's valuation ratio determines whether it is overvalued or undervalued. If the ratio is high, then it is overvalued"},{"tag":"ipo","patterns":"what is an IPO?","responses":"An IPO is an initial public offering. It's when a company initially becomes publicly available for any investor to buy shares."},{"tag":"sell","patterns":"when should I sell?","responses":"Generally speaking, its smart for an investor to sell if they believe the company is no longer worth what it is trading for, or they believe there are better investments available."},{"tag":"time spent researching","patterns":"how much time should I spend researching a stock?","responses":"There isn't a set amount of time, however its important to have a good understanding of what the company does, what they're financials are, approximately what a company should be worth, and a general idea of future expectations for the company."},{"tag":"stocks to avoid","patterns":"what kind of stocks should I avoid?","responses":"Just like I can't recommend stocks, I also can't tell you what to avoid. But in general, it can be more effective investing in companies that you best understand and are confident in."},{"tag":"company filings","patterns":"where can I find the companies filings?","responses":"The company's filings can be found in their investor relations page on their website, or on the sec website."},{"tag":"beating analyst expectations","patterns":"is beating analyst expectations good?","responses":"It is typically a good thing to beat analyst expecations since it means the company is performing better than what others expect. Persistently outperforming can be a good indicator of a valuable company."},{"tag":"book value","patterns":"what is book vlaue?","responses":"Book value is the amount reported on a company's balance sheet."},{"tag":"book vs market value","patterns":"whats the difference between book value and market value?","responses":"The values on a company's balance sheet are reported at historical cost (except for certain items such as financial instruments). Market value reflects the actual price a person or company would be willing to pay for something. Due to inflation and other economic changes, market and book value and differ significantly."},{"tag":"insider","patterns":"who are insiders?","responses":"An insider is a director, senior officer, entity, or individual that owns more than 10% of a publicly traded company's voting shares. Insider trading is when insiders buy or sell shares of a company based on material information not readily available to the general public."},{"tag":"insider transactions","patterns":"what are insider transactions?","responses":"An insider is a director, senior officer, entity, or individual that owns more than 10% of a publicly traded company's voting shares. Insider trading is when insiders buy or sell shares of a company based on material information not readily available to the general public."},{"tag":"positive mentions","patterns":"what are positive mentions?","responses":"Positive mentions are the total number of tweets, comments, etc counted that users made about a specific stock that expressed an overall good opinion about the company."},{"tag":"negative mentions","patterns":"what are negative mentions?","responses":"Negative mentions are the total number of tweets, comments, etc counted that users made about a specific stock that expressed an overall bad opinion about the company."},{"tag":"other mentions","patterns":"what are other mentions in sentiment analysis?","responses":"Other mentions are the total number of tweets, comments, etc counted that users made about a specific stock that expressed an overall neutral opinion about the company."},{"tag":"calculating sentiment","patterns":"how is sentiment analysis calculated?","responses":"Sentiment analysis is based on the ratio of total positive mentions (which are +1) and total negative mentions (which are -1) divided by the total amount of comments"},{"tag":"where to start","patterns":"where should I start?","responses":"Try hitting the get started button!"},{"tag":"analyst estimates","patterns":"what are analyst estimates?","responses":"An analyst expectation is a report issued by an individual analyst, investment bank or financial services company indicating how a particular company's stock will perform in the coming quarter. The concensus values we provide represent the average value for all estimates analysts have made for that company."},{"tag":"analyst estimates","patterns":"what is an eps estimate?","responses":"An analyst expectation is a report issued by an individual analyst, investment bank or financial services company indicating how a particular company's stock will perform in the coming quarter. The concensus values we provide represent the average value for all estimates analysts have made for that company."},{"tag":"analyst estimates","patterns":"what is a revenue estimate?","responses":"An analyst expectation is a report issued by an individual analyst, investment bank or financial services company indicating how a particular company's stock will perform in the coming quarter. The concensus values we provide represent the average value for all estimates analysts have made for that company."},{"tag":"best stocks","patterns":"what stock do you recommend? What should I buy?","responses":"Unfortunately I'm unable to recommend specific investments. This website is made for people to make their own decisions!"},{"tag":"insider trading","patterns":"what is insider trading?","responses":"There are 2 types, legal and illegal. Illegal trading is buying or selling based on material non-public information. Legal insider trading is trading by insiders that follows a strict protocal with the sec with an order placed at least 6 months ahead of time. One famous investor, Peter Lynch, was quoted saying \"insiders might sell their shares for any number of reasons, but they buy them for only one: they think the price will rise.\""},{"tag":"best stocks","patterns":"what stock do you recommend? ","responses":"I am unable to recommend specific investments. Instead, I'm simply a source for any general questions you may have about the data available"},{"tag":"best stocks","patterns":"What should I buy?","responses":"I am unable to recommend specific investments. Instead, I'm simply a source for any general questions you may have about the data available"}

    ]
  }